Repository: DesignPatternsPHP/DesignPatternsPHP
Catalog: locale/*/LC_MESSAGES/Behavioral/ChainOfResponsibilities/README.po
Languages: es_mx, pl, pt_br, ru, tr

source: Chain Of Responsibilities
es_mx: Cadena de Responsabilidad
tr: Chain Of Responsibilities (Yüklenim Zinciri)

source: Purpose
es_mx: Propósito
pl: Przeznaczenie
pt_br: Objetivo
tr: Amaç

source: To build a chain of objects to handle a call in sequential order. If one object cannot handle a call, it delegates the call to the next in the chain and so forth.
es_mx: Para crear una cadena de objetos que atiendan una llamada en orden secuencial. Si un objeto no puede atender la llamada, delega esta al siguiente objeto en la cadena, y así sucesivamente.
pl: Zbudowanie łańcucha obiektów przetwarzających żądanie w sposób sekwencyjny. Jeżeli jeden obiekt nie może obsłużyć żądania, przekazuje je do następnego w łańcuchu.
pt_br: Construir uma cadeia de objetos para manipular uma chamada em ordem sequencial. Se um objeto não pode manipular a chamada, ele delega a chamada para o próximo na cadeia e assim por diante.
ru: Построить цепочку объектов для обработки вызова в последовательном порядке. Если один объект не может справиться с вызовом, он делегирует вызов для следующего в цепи и так далее.
tr: Bir isteme sıralı bir düzende cevap verecek bir nesneler zinciri oluşturmak. Eğer bir nesne bir istemi çözümleyemezse, bu istemi zincirdeki bir sonraki nesneye devreder.

source: Examples
es_mx: Ejemplos
pl: Przykłady
pt_br: Exemplos
tr: Örnekler

source: Logging framework: where each chain element decides autonomously what to do with a log message.
es_mx: Un framework de registro de eventos: en la que cada elemento de la cadena decide autónomamente que hacer con un mensaje de evento.
tr: Logging framework (kayıtlama yapısı): Zincirin her elemanı, bir kayıt iletisiyle ne yapacağına bağımsız bir şekilde karar verir.

source: A Spam filter.
es_mx: Un filtro de spam.
tr: Bir spam filtresi.

source: Caching: first object is an instance of e.g. a Memcached Interface, if that "misses" it delegates the call to the database interface.
es_mx: Almacenamiento en caché: la primera instancia p.ej. es una interfaz Memcached, si esta "falla" delega la llamada a la interfaz de base de datos.
tr: Caching (önbellekleme): Mesela ilk nesne, örn. Memcached Interface'idir. Eğer (bu nesne) istemi "çözümleyemezse", istemi Database Interface'ine devreder.

source: Yii Framework: CFilterChain is a chain of controller action filters. the executing point is passed from one filter to the next along the chain, and only if all filters say "yes", the action can be invoked at last.
es_mx: Framework Yii: CFilterChain es una cadena de filtros de acción de controlador. El punto de ejecución es pasado de un filtro al siguiente en la cadena y solamente si un filtro responde "sí", la acción puede ser por fin invocada.
pl: Yii Framework: CFilterChain jest łańcuchem filtrów dla danej akcji kontrolera. Wszystkie filtry są wykonywane po kolei w łańcuchu i dopiero jak wszystkie zwrócą pozytywny wynik finalna akcja zostanie uruchomiona.
pt_br: Yii Framework: CFilterChain é uma cadeia de filtros de ações do controlador. O ponto em execução é passado de um filtro para o próximo ao longo da cadeia e apenas se todos os filtros dizem "sim", a ação pode ser finalmente invocada.
ru: Yii Framework: CFilterChain — это цепочка фильтров действий контроллера. Точка вызова передаётся от фильтра к фильтру по цепочке и только если все фильтры скажут “да”, действие в итоге может быть вызвано.
tr: Yii Framework: CFilterChain, bir denetleyici eylemi (controller action) için filtreler zinciridir. Çalışım noktası zincir boyunca bir filtreden diğerine geçer, ve ancak tüm filtreler "evet" derse en son aşamada eylem çağrılabilir.

source: UML Diagram
es_mx: Diagrama UML
pl: Diagram UML
pt_br: Diagrama UML
ru: UML Диаграмма
tr: UML Diyagramı

source: Alt ChainOfResponsibility UML Diagram
es_mx: Alt DiagramaUML CadenaDeResponsabilidad
tr: Alt ChainOfResponsibility UML Diyagramı

source: Code
es_mx: Código
pl: Kod
pt_br: Código
ru: Код
tr: Kod

source: You can also find these code on `GitHub`_
es_mx: Puedes encontrar este código también en `GitHub`_
ru: Вы можете найти этот код на `GitHub`_

source: Test
es_mx: Pruebas
pl: Testy
pt_br: Teste
ru: Тест

source: `Chain Of Responsibilities`__
pl: `Łańcuch zobowiązań <https://pl.wikipedia.org/wiki/%C5%81a%C5%84cuch_zobowi%C4%85za%C5%84_(wzorzec_projektowy)>`_ (`Chain Of Responsibilities`__)
pt_br: `Cadeia de Responsabilidades (Chain Of Responsibilities)`__
ru: `Цепочка Обязанностей <https://ru.wikipedia.org/wiki/Цепочка_обязанностей>`_ (`Chain Of Responsibilities`__)

source: logging framework, where each chain element decides autonomously what to do with a log message
pl: Framework do zapisywania logów, gdzie każdy obiekt z łańcucha odpowiedzialności decyduje co zrobić z danym wpisem.
pt_br: estrutura de log, onde cada elemento da cadeia decide autonomamente o que fazer com a mensagem de log
ru: фреймворк для записи журналов, где каждый элемент цепи самостоятельно принимает решение, что делать с сообщением для логгирования.

source: a Spam filter
pl: filtr antyspamowy
pt_br: um filtro de Spam
ru: фильтр спама

source: Caching: first object is an instance of e.g. a Memcached Interface, if that "misses" it delegates the call to the database interface
pl: Zapis w pamięci podręcznej (caching): pierwszy obiekt jest na przykład instancją implementującą interfejs Memcached - jeżeli nie może zapisać w pamięci podręcznej żądania, wtedy przekazuje je do obiektu implementującego interfejs zapisu w bazie danych.
pt_br: Cache: o primeiro objeto é uma instância de p.e. uma interface Memcached, se essa "falta" é delegada a chamada à interface de banco de dados.
ru: кеширование: первый объект является экземпляром, к примеру, интерфейса Memcached. Если запись в кеше отсутствует, вызов делегируется интерфейсу базы данных.

source: You can also find this code on `GitHub`_
pl: Ten kod znajdziesz również na `GitHub`_.
pt_br: Você também pode encontrar este código no `GitHub`_
tr: Bu kodu `Github`_ üzerinde de bulabilirsiniz.

source: Purpose:
ru: Назначение:

source: Examples:
ru: Примеры:
