Repository: DesignPatternsPHP/DesignPatternsPHP
Catalog: locale/*/LC_MESSAGES/Structural/Decorator/README.po
Languages: tr

source: Decorator
tr: Decorator (Bezeyici)

source: Purpose
tr: Amaç

source: To dynamically add new functionality to class instances.
tr: Sınıf örneklerine (instance) dinamik olarak yeni işlevler eklemek.

source: Examples
tr: Örnekler

source: Zend Framework: decorators for ``Zend_Form_Element`` instances
tr: Zend Framework: ``Zend_Form_Element`` için kullanılan bezeyiciler.

source: Web Service Layer: Decorators JSON and XML for a REST service (in this case, only one of these should be allowed of course)
tr: Web Servisi Katmanı (Layer): Bir REST servisi için kullanılan JSON ve XML bezeyicileri (not: elbette böyle bir durumda bunlardan yalnızca bir tanesine izin verilmiş olabilir).

source: UML Diagram
tr: UML Diyagramı

source: Alt Decorator UML Diagram
tr: Alt Decorator UML Diyagramı

source: Code
tr: Kod

source: You can also find this code on `GitHub`_
tr: Bu kodu `Github`_ üzerinde de bulabilirsiniz.
