Repository: DesignPatternsPHP/DesignPatternsPHP
Catalog: locale/*/LC_MESSAGES/README.po
Languages: es_mx, pl, ru, tr, zh_cn

source: DesignPatternsPHP
es_mx: DesignPatternsPHP (Patrones de Diseño en PHP)
tr: Design Patterns PHP (Tasarım Desenleri PHP)
zh_cn: PHP设计模式范例

source: This is a collection of known `design patterns`_ and some sample code how to implement them in PHP. Every pattern has a small list of examples (most of them from Zend Framework, Symfony2 or Doctrine2 as I'm most familiar with this software).
es_mx: Esta es una colección de `patrones de diseño`_ conocidos y ejemplos de código de cómo implementarlos en PHP. Cada patrón tiene una pequeña lista de ejemplos (la mayoría de Zend Framework, Symfony2 o Doctrine2, ya que es el software que me es más familiar).
pl: Poniższe zestawienie to zbiór wzorców projektowych wraz z przykładowym kodem źródłowym ilustrującym ich implementację w PHP. Każdy z nich posiada przykłady, pochodzące głównie z Zend Framework, Symfony2 lub Doctrine2 (jako że najlepiej znam to oprogramowanie).
ru: Это набор известных `шаблонов проектирования <https://ru.wikipedia.org/wiki/Шаблон_проектирования>`_ (паттернов) и некоторые примеры их реализации в PHP. Каждый паттерн содержит небольшой перечень примеров (большинство из них для ZendFramework, Symfony2 или Doctrine2, так как я лучше всего знаком с этим программным обеспечением).
tr: Bu, `tasarım desenleri`_ olarak bilinen kalıpların bir derlemesidir ve örnek kodlar bu kalıpların PHP'de nasıl uygulanabileceğini gösterir. Her desen (sayfası)küçük kod örnekleri içerir. Bu örneklerin çoğu kendimin aşina olduğu Zend Framework, Symfony2, veya Doctrine2 yapılarındandır.
zh_cn: 这里收集了一些知名的 `设计模式`_ 以及它们对应的 PHP 实现的代码，每个模式都附有一个实际的例子（大多来源于Zend Framework， Symfony2 和 Doctrine2等）。

source: I think the problem with patterns is that often people do know them but don't know when to apply which.
es_mx: Creo que el problema con los patrones es que muchas veces las personas los conocen pero no saben cuando aplicar cual.
pl: Uważam, że głównym problemem związanym z wzorcami projektowymi jest to, że ludzie je znają, ale nie wiedzą, kiedy którego użyć.
ru: Я считаю, проблема паттернов в том, что люди часто знакомы с ними, но не представляют как их применять.
tr: Sanırım desenlerle ilgili sorun, insanların desenleri bilmesi, ancak hangi durumda, hangisini kullanacaklarını genellikle bilmemesidir.
zh_cn: 我认为人们对于设计模式抱有的问题在于大家都了解它们却不知道该如何在实际中使用它们。

source: Patterns
es_mx: Patrones
pl: Wzorce projektowe
ru: Паттерны
tr: Desenler
zh_cn: 模式

source: The patterns can be structured in roughly three different categories. Please click on **the title of every pattern's page** for a full explanation of the pattern on Wikipedia.
es_mx: Los patrones se pueden organizar a grandes rasgos en tres diferentes categorías. Por favor has click en **el título de cada página de los patrones** para una explicación completa del patrón en Wikipedia.
pl: Wzorce projektowe można z grubsza podzielić na trzy kategorie. Kliknij na **nazwę wzorca**, aby zobaczyć pełny opis dane wzorca w Wikipedii.
ru: Паттерны могут быть условно сгруппированы в три различные категории. Нажмите на **заголовок каждой страницы с паттерном** для детального объяснения паттерна в Википедии.
tr: Desenler kabaca üç farklı kategoride gruplandırılabilir. Lütfen her desenin detaylı açıklamalarının olduğu Wikipedia sayfalarına göz atmayı unutmayınız.
zh_cn: 模式可以简单的被分为三大类。你可以点击每个模式页面下的标题来转到维基百科页面，来获取关于该模式更为详细的解释。

source: Contribute
es_mx: Contribuciones
pl: Rozwijaj
ru: Участие в разработке
tr: Katkıda Bulunun
zh_cn: 贡献

source: Please feel free to fork and extend existing or add your own examples and send a pull request with your changes! To establish a consistent code quality, please check your code using `PHP CodeSniffer`_ against `PSR2 standard`_ using ``./vendor/bin/phpcs -p --standard=PSR2 --ignore=vendor .``.
es_mx: Por favor ten la libertad de copiar el repositorio y extender o agregar tus propios ejemplos y envía un *pull request* con tus cambios! Para establecer una calidad de código consistente, por favor revisa tu código usando `PHP CodeSniffer`_ contra el `estándar PSR2`_ usando ``./vendor/bin/phpcs -p --standard=PSR2 --ignore=vendor .``.
zh_cn: 欢迎你fork代码修改和提pr，为了保证代码的质量，请使用 `PHP CodeSniffer`_ 检查你的代码是否遵守 `PSR2 编码规范`_，使用 ``./vendor/bin/phpcs -p --standard=PSR2 --ignore=vendor .``. 命令检查。

source: License
es_mx: Licencia
pl: Licencja
ru: Лицензия
zh_cn: 协议

source: (The MIT License)
pl: (Licencja MIT)
zh_cn: MIT 授权协议

source: Copyright (c) 2014 `Dominik Liebler`_ and `contributors`_
zh_cn: Copyright (c) 2014 `Dominik Liebler`_ 和 `贡献者`_

source: Permission is hereby granted, free of charge, to any person obtaining a copy of this software and associated documentation files (the 'Software'), to deal in the Software without restriction, including without limitation the rights to use, copy, modify, merge, publish, distribute, sublicense, and/or sell copies of the Software, and to permit persons to whom the Software is furnished to do so, subject to the following conditions:
pl: Niniejszym gwarantuje się, bez opłat, że każda osoba, która wejdzie w posiadanie kopii tego oprogramowania i związanych z nim plików dokumentacji (dalej "Oprogramowanie") może wprowadzać do obrotu Oprogramowanie bez żadnych ograniczeń, w tym bez ograniczeń prawa do użytkowania, kopiowania, modyfikowania, łączenia, publikowania, dystrybuowania, sublicencjonowania i/lub sprzedaży kopii Oprogramowania a także zezwalania osobie, której Oprogramowanie zostało dostarczone czynienia tego samego, z zastrzeżeniem następujących warunków:
ru: Данная лицензия разрешает лицам, получившим копию данного программного обеспечения и сопутствующую документациию (в дальнейшем именуемыми «Программное Обеспечение»), безвозмездно использовать Программное Обеспечение без ограничений, включая неограниченное право на использование, копирование, изменение, добавление, публикацию, распространение, сублицензирование и/или продажу копий Программного Обеспечения, а также лицам, которым предоставляется данное Программное Обеспечение, при соблюдении следующих условий:
zh_cn: 在此授权给任何遵守本软件授权协议的人免费使用的权利，可以不受限制的的使用，包括不受限制的使用，复制，修改，合并，重新发布，分发，改变授权许可，甚至售卖本软件的拷贝，同时也允许买这个软件的个人也具备上述权利，大意如下：

source: The above copyright notice and this permission notice shall be included in all copies or substantial portions of the Software.
pl: Powyższa nota zastrzegająca prawa autorskie oraz niniejsza nota zezwalająca muszą zostać włączone do wszystkich kopii lub istotnych części Oprogramowania.
ru: Указанное выше уведомление об авторском праве и данные условия должны быть включены во все копии или значимые части данного Программного Обеспечения.
zh_cn: 上面的权利和授权注意事项应该被包括在本软件的所有的派生分支/版本中

source: THE SOFTWARE IS PROVIDED 'AS IS', WITHOUT WARRANTY OF ANY KIND, EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM, OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE SOFTWARE.
pl: Oprogramowanie jest dostarczone takim, jakie jest, bez jakiejkolwiek gwarancji, wyraźnej lub dorozumianej, nie wyłączając gwarancji przydatności handlowej lub przydatności do określonych celów a także braku wad prawnych. W żadnym przypadku twórca lub posiadacz praw autorskich nie może ponosić odpowiedzialności z tytułu roszczeń lub wyrządzonej szkody a także żadnej innej odpowiedzialności czy to wynikającej z umowy, deliktu, czy jakiejkolwiek innej podstawy powstałej w związku z oprogramowaniem lub użytkowaniem go lub wprowadzaniem go do obrotu.
ru: ДАННОЕ ПРОГРАММНОЕ ОБЕСПЕЧЕНИЕ ПРЕДОСТАВЛЯЕТСЯ «КАК ЕСТЬ», БЕЗ КАКИХ-ЛИБО ГАРАНТИЙ, ЯВНО ВЫРАЖЕННЫХ ИЛИ ПОДРАЗУМЕВАЕМЫХ, ВКЛЮЧАЯ ГАРАНТИИ ТОВАРНОЙ ПРИГОДНОСТИ, СООТВЕТСТВИЯ ПО ЕГО КОНКРЕТНОМУ НАЗНАЧЕНИЮ И ОТСУТСТВИЯ НАРУШЕНИЙ, НО НЕ ОГРАНИЧИВАЯСЬ ИМИ. НИ В КАКОМ СЛУЧАЕ АВТОРЫ ИЛИ ПРАВООБЛАДАТЕЛИ НЕ НЕСУТ ОТВЕТСТВЕННОСТИ ПО КАКИМ-ЛИБО ИСКАМ, ЗА УЩЕРБ ИЛИ ПО ИНЫМ ТРЕБОВАНИЯМ, В ТОМ ЧИСЛЕ, ПРИ ДЕЙСТВИИ КОНТРАКТА, ДЕЛИКТЕ ИЛИ ИНОЙ СИТУАЦИИ, ВОЗНИКШИМ ИЗ-ЗА ИСПОЛЬЗОВАНИЯ ПРОГРАММНОГО ОБЕСПЕЧЕНИЯ ИЛИ ИНЫХ ДЕЙСТВИЙ С ПРОГРАММНЫМ ОБЕСПЕЧЕНИЕМ.
zh_cn: 该软件是'按原样'提供的，没有任何形式的明示或暗示，包括但不限于为特定目的和不侵权的适销性和适用性的保证担保。在任何情况下，作者或版权持有人，都无权要求任何索赔，或有关损害赔偿的其他责任。无论在本软件的使用上或其他买卖交易中，是否涉及合同，侵权或其他行为。

source: Documentation Status
es_mx: Estatus de la documentación
tr: Dokümantasyon Durumu

source: `design patterns`
es_mx: `patrones de diseño`
tr: `tasarım desenleri`

source: `PSR2 standard`
es_mx: `estándar PSR2`
tr: `PSR2 standartı`

source: `contributors`
es_mx: `contribuidores`
tr: `katkıda bulunanlar`

source: If you encounter any bugs or missing translations, please feel free to fork and send a pull request with your changes. To establish a consistent code quality, please check your code using `PHP CodeSniffer`_ against `PSR2 standard`_ using ``./vendor/bin/phpcs -p --standard=PSR2 --ignore=vendor .``.
pl: Jeżeli zauważysz błędy czy brakujące tłumaczenie skorzystaj z opcji ``fork`` i uzupełnij braki. Pamiętaj o ``pull request``! Skorzystaj z opcji fork aby rozszerzać lub dodawać swoje przykłady! Dla utrzymania spójnego kodu o dobrej jakości, używaj `PHP CodeSniffer`_ razem ze `Standardem PSR2`_ w taki sposób: `./vendor/bin/phpcs -p --standard=PSR2 --ignore=vendor .`.
ru: Если вы обнаружили ошибки или отсутствие перевода, вы можете прислать пулл реквест с вашими изменениями. Чтобы сохранять высокое качество кода, пожалуйста, проверяйте ваш код с помощью `PHP CodeSniffer`_ на соответствие стандарту `PSR2`_, используя команду ``./vendor/bin/phpcs -p --standard=PSR2 --ignore=vendor .``.
tr: Eğer bir yazılım hatası (bug) veya hatalı çeviriyle karşılaşırsanız, lütfen fork yaparak yaptığınız değişiklerle beraber pull request gönderiniz. Tutarlı bir kod kalitesi sağlamak için, lütfen kodunuzu `PHP CodeSniffer`_ kullanarak kontrol ediniz. Örn: `PSR2 standartı`_ için ``./vendor/bin/phpcs -p --standard=PSR2 --ignore=vendor .``.

source: Copyright (c) 2011 - 2017 `Dominik Liebler`_ and `contributors`_
pl: Copyright (c) 2011 - 2017 `Dominik Liebler`_ i `twórcy`_
