Repository: DesignPatternsPHP/DesignPatternsPHP
Catalog: locale/*/LC_MESSAGES/Creational/FactoryMethod/README.po
Languages: bg, es_mx, pl, pt_br, tr, zh_cn

source: Factory Method
es_mx: Método Fábrica
tr: Factory Method (Fabrika Yöntemi)

source: Purpose
bg: Предназначение
es_mx: Propósito
pl: Przeznaczenie
pt_br: Objetivo
tr: Amaç
zh_cn: 目的

source: The good point over the SimpleFactory is you can subclass it to implement different ways to create objects.
bg: Добрата точка за SimpleFactory е, че можете да го подкласирате, за да реализира различни начини за създаване на обекти.
es_mx: Un punto a favor sobre la Fábrica Simple es que se pueden crear subclases para implementar diferentes formas de crear objetos.
pt_br: O ponto positivo em relação ao SimpleFactory é que pode-se extender sua implementação de diferentes maneiras para a criação de objetos.
tr: Fabrika Yöntemi'nin güzel tarafı Simple Factory aksine, kendisini alt neslerle genişleterek (subclassing), bu yolla farklı biçimlerde nesne oluşturabilmeye olanak sağlamasıdır.

source: For simple case, this abstract class could be just an interface.
es_mx: Para un caso simple, esta clase abstracta podría ser simplemente una interfaz.
tr: Basit bir durum için ise, bu soyut sınıf (abstract class) yanlızca bir arayüz (interface) de olabilir.

source: This pattern is a "real" Design Pattern because it achieves the Dependency Dependency Inversion principle a.k.a the "D" in SOLID principles.
es_mx: Este es un patrón "real" de diseño porque realiza el Principio de Inversión de Dependencia, también conocido como la "D" de los principios S.O.L.I.D.

source: It means the FactoryMethod class depends on abstractions, not concrete classes. This is the real trick compared to SimpleFactory or StaticFactory.
bg: Това означава, че класът FactoryMethod зависи от абстракциите, а не от конкретни класове. Това е истинският трик в сравнение с SimpleFactory или StaticFactory.
es_mx: Esto significa que la clase del Método Fábrica depende de abstracciones, no clases concretas. Este es el verdadero truco comparado con la Fábrica Simple o Fábrica Estática.
pl: Oznacza to, że klasa ``FactoryMethod`` opiera się na abstrakcji, a nie na konkretnej implementacji. Widać w porównaniu z Fabryką uproszczoną czy Fabryką statyczną.
pt_br: Significa que a Fábrica de Método depende de abstrações, não implementação. Este é uma vantagem comparado ao SimpleFactory ou StaticFactory.
tr: Bu, Factory Method sınıfının somut sınıflara değil soyutlamalara (abstraction) dayandığı anlamına gelir. İşte işin püf noktası da, Simple Factory veya Static Factory ile karşılaştırıldığında budur.
zh_cn: 它意味着工厂方法类依赖于类的抽象，而不是具体将被创建的类，这是工厂方法模式与简单工厂模式和静态工厂模式最重要的区别

source: UML Diagram
bg: UML Диаграма
es_mx: Diagrama UML
pl: Diagram UML
pt_br: Diagrama UML
tr: UML Diyagramı
zh_cn: UML 图

source: Alt FactoryMethod UML Diagram
es_mx: Alt Diagrama UML MétodoFábrica
tr: Alt FactoryMethod UML Diyagramı

source: Code
bg: Код
es_mx: Código
pl: Kod
pt_br: Código
tr: Kod
zh_cn: 代码

source: You can also find this code on `GitHub`_
bg: Можете също да намерите този код в `GitHub`_
es_mx: Puedes encontrar este código también en `GitHub`_
pl: Ten kod znajdziesz również na `GitHub`_.
pt_br: Você pode encontrar este código no `Github`_
tr: Bu kodu `Github`_ üzerinde de bulabilirsiniz.
zh_cn: 你可以在 `GitHub`_ 上找到这些代码

source: Test
bg: Тест
es_mx: Pruebas
pl: Testy
pt_br: Teste
zh_cn: 测试

source: `Factory Method`__
bg: `Метод Фабрика`__
pl: `Metoda wytwórcza <https://pl.wikipedia.org/wiki/Metoda_wytw%C3%B3rcza_(wzorzec_projektowy)>`_ (`Factory Method`__)
pt_br: Fábrica de Métodos (`Factory Method`__)
zh_cn: `工厂方法`__

source: For simple cases, this abstract class could be just an interface.
bg: За прости случаи този абстрактен клас може да бъде просто интерфейс.
pt_br: Para casos simples, esta classe abstrata pode ser apenas uma interface.

source: This pattern is a "real" Design Pattern because it achieves the Dependency Inversion principle a.k.a the "D" in SOLID principles.
bg: Този модел е "истински" шаблон на проектиране, тъй като постига принципа на инверсия на зависимостите, известен още като "D" в SOLID принципите.
pl: Ten wzorzec implementuje jedną z podstawowych zasad programowania obiektowego `SOLID <https://pl.wikipedia.org/wiki/SOLID_(programowanie_obiektowe)>`_ - "D" - zasadę odwrócenia zależności (ang. `Dependency inversion principle`).
pt_br: Este padrão é um padrão de projetos de software "real" já que trata o "Princípio da inversão de dependências" o "D" nos princípios SOLID
zh_cn: 这个模式是一个 "真正" 的设计模式，因为它遵循了依赖反转原则（Dependency Inversion Principle） 众所周知这个 "D" 代表了真正的面向对象程序设计。

source: The good point over the SimpleFactory is you can subclass it to implement different ways to create objects
pl: Przewagą Metody wytwórczej nad Fabryką uproszczoną jest możliwość implementowania różnych sposobów tworzenia obiektów poprzez dziedziczenie po klasie Metody wytwórczej.
zh_cn: 比简单工厂模式好的一点是工厂方法可以通过继承实现不同的创建对象的逻辑。

source: For simple case, this abstract class could be just an interface
pl: W prostych przypadkach zamiast klasy abstrakcyjnej można użyć zwykłego interfejsu.
zh_cn: 举个简单的例子，这些抽象类都仅仅是一个接口

source: This pattern is a "real" Design Pattern because it achieves the "Dependency Inversion Principle" a.k.a the "D" in S.O.L.I.D principles.
tr: Bu desen "gerçek" bir Tasarım Deseni'dir, çünkü S.O.L.I.D ilkelerinden biri olan "D" yani "Dependency Inversion Principle (Bağımlılık Tersinme İlkesi)" bölümünün sorumluluğunu yerine getirir.
