Repository: DesignPatternsPHP/DesignPatternsPHP
Catalog: locale/*/LC_MESSAGES/Structural/DataMapper/README.po
Languages: tr

source: Data Mapper
tr: Data Mapper (Veri Haritalayıcı)

source: Purpose
tr: Amaç

source: A Data Mapper, is a Data Access Layer that performs bidirectional transfer of data between a persistent data store (often a relational database) and an in memory data representation (the domain layer). The goal of the pattern is to keep the in memory representation and the persistent data store independent of each other and the data mapper itself. The layer is composed of one or more mappers (or Data Access Objects), performing the data transfer. Mapper implementations vary in scope. Generic mappers will handle many different domain entity types, dedicated mappers will handle one or a few.
tr: Bir Veri Haritalayıcı, kalıcı bir veri deposu (çoğunlukla ilişkisel bir veritabanı (relational database)) ile bellekteki veri sunumu katmanı (alan katmanı, sunum katmanı (domain layer, representation layer)) arasında çift yönlü veri aktarımını gerçekleştiren bir Veri Erişim Katmanıdır (Data Access Layer).Desenin amacı, bellekteki verinin sunum katmanını ve kalıcı veri deposunu birbirinden ve de kendisinden bağımsız tutmaktır. Katman, veri aktarımını gerçekleştiren bir veya daha fazla haritalayıcıdan (veya Veri Erişim Nesnesi'nden (Data Access Object)) oluşur. Haritalayıcı uygulanımları (implementation) kapsama göre değişiklik gösterir. Üretken (generic) haritalayıcılar birkaç farklı alanın varlık türü (entity type) ile işlerken, özel (dedicated) haritalayıcılar bir veya birkaçıyla işler.

source: The key point of this pattern is, unlike Active Record pattern, the data model follows Single Responsibility Principle.
tr: Bu desenin kilit noktası, Etkin Kayıt (Active Record) deseninden farklı olarak, veri modelinin Tek Sorumluluk İlkesi'ni (Single Responsibility Principle) uygulamasıdır.

source: Examples
tr: Örnekler

source: DB Object Relational Mapper (ORM) : Doctrine2 uses DAO named as "EntityRepository"
tr: İlişkisel Veri Haritalayıcı (Object Relational Mapper (ORM)): Doctrine 2, "EntityRepository" adında bir Veri Erişim Nesnesi (Data Access Object (DAO)) kullanır.

source: UML Diagram
tr: UML Diyagramı

source: Alt DataMapper UML Diagram
tr: Alt DataMapper UML Diyagramı

source: Code
tr: Kod

source: You can also find this code on `GitHub`_
tr: Bu kodu `Github`_ üzerinde de bulabilirsiniz.
