Repository: DesignPatternsPHP/DesignPatternsPHP
Catalog: locale/*/LC_MESSAGES/Creational/Builder/README.po
Languages: pt_br, tr, zh_cn

source: `Builder`__
pt_br: Construtor (`Builder`__)
zh_cn: 生成器模式

source: Purpose
pt_br: Objetivo
tr: Amaç
zh_cn: 目的

source: Builder is an interface that build parts of a complex object.
pt_br: Contrutor é uma interface que constrói partes de objetos complexos.
tr: Yapıcı, karmaşık bir nesnenin parçalarını oluşturan bir arayüzdür.
zh_cn: 生成器的目的是将复杂对象的创建过程（流程）进行抽象，生成器表现为接口的形式。

source: Sometimes, if the builder has a better knowledge of what it builds, this interface could be an abstract class with default methods (aka adapter).
pt_br: As vezes, se o construtor tem melhor conhecimento do que ele cria, essa interface pode ser uma classe abstrata com métodos padrão (como o padrão adaptador).
tr: Bazen yapıcı, oluşturduğu şey hakkında daha iyi bir bilgiye sahipse, bir arayüz (interface) yerine varsayılan yöntemlere (method) sahip soyut bir sınıf (class) olabilir (diğer bir deyişle bir adaptör (adapter)).
zh_cn: 在特定的情况下，比如如果生成器对将要创建的对象有足够多的了解，那么代表生成器的接口(interface)可以是一个抽象类(也就是说可以有一定的具体实现，就像众所周知的适配器模式)。

source: If you have a complex inheritance tree for objects, it is logical to have a complex inheritance tree for builders too.
pt_br: Se você tem uma árvore de herança entre objetos complexa, é lógico que se tenha uma árvore de herança complexa para os construtores também
tr: Eğer nesneler için girift bir kalıtım ağacınız (inheritance tree) varsa, yapıcılar için de girift bir kalıtım ağacınızın olması mantıklı olacaktır.
zh_cn: 如果对象有复杂的继承树，理论上创建对象的生成器也同样具有复杂的继承树。

source: Note: Builders have often a fluent interface, see the mock builder of PHPUnit for example.
pt_br: Nota: Construtores têm frequentemente, uma interface fluente. Veja o construtor mock do PHPUnit, por exemplo.
tr: Not: Yapıcılar çoğu zaman akıcı bir arayüze sahiptir, örneğin PHPUnit'in yapay (mock) yapıcısına bakabilirsiniz.
zh_cn: 提示：生成器通常具有流畅的接口，推荐阅读关于 PHPUnit 的mock生成器获取更好的理解。

source: Examples
pt_br: Exemplos
tr: Örnekler
zh_cn: 例子

source: PHPUnit: Mock Builder
pt_br: PHPUnit: Contrutor Mock
zh_cn: PHPUnit: Mock 生成器

source: UML Diagram
pt_br: Diagrama UML
tr: UML Diyagramı
zh_cn: UML 图

source: Code
pt_br: Código
tr: Kod
zh_cn: 代码

source: You can also find this code on `GitHub`_
pt_br: Você pode encontrar esse código no `Github`_
tr: Bu kodu `Github`_ üzerinde de bulabilirsiniz.
zh_cn: 你可以在 `GitHub`_ 上找到这些代码

source: Test
zh_cn: 测试

source: Builder
tr: Builder (Yapıcı)

source: Alt Builder UML Diagram
tr: Alt Builder UML Diyagramı
