Repository: DesignPatternsPHP/DesignPatternsPHP
Catalog: locale/*/LC_MESSAGES/Behavioral/NullObject/README.po
Languages: bg, es_mx, fr, nl, pl, pt_br, ru, tr

source: Null Object
es_mx: Objeto Nulo
tr: Null Object (Boş Nesne)

source: Purpose
bg: Предназначение
es_mx: Propósito
fr: Rôle
nl: Doel
pl: Przeznaczenie
pt_br: Objetivo
ru: Назначение
tr: Amaç

source: NullObject is not a GoF design pattern but a schema which appears frequently enough to be considered a pattern. It has the following benefits:
bg: Null Object не е шаблон на GoF дизайн, а схема, която се появява достатъчно често, за да се счита за шаблон. Той има следните предимства:
es_mx: El Objeto Nulo no es un patrón del GoF (Gang of Four) pero un esquema que aparece tan frecuentemente para ser considerada un patrón. Tiene los siguientes beneficios:
fr: NullObject n'est pas un patron de conception du GoF mais un schéma qui apparaît suffisamment fréquemment pour être considéré comme un patron. Il présente les avantages suivants :
nl: NullObject is niet GoF ontwerp maar een schema dat vaak voorkomt dat als een patroon kan worden behandeld. Het heeft de volgende voordelen:
pl: Pusty Obiekt nie jest wzrorcem zaproponowanym przez Bandę Czterech, niemniej jednak jest na tyle popularny, że może być uznany za wzorzec. Użycie tego wzorca niesie następujące korzyści:
pt_br: Objeto Nulo (Null Object) não é um padrão de projeto GoF, mas um esquema o qual aparece com frequencia suficiente para ser considerado um padrão. Ele tem os seguintes benefícios:
ru: NullObject не шаблон из книги Банды Четырёх, но схема, которая появляется достаточно часто, чтобы считаться паттерном. Она имеет следующие преимущества:
tr: Boş Nesne, bir Dörtlü Takım (Gang of Four) tasarım deseni değildir. Ancak, bir şemadır ve görünen o ki sıklıkla bir desen olarak ele alınmaktadır.Aşağıdaki yararlıklara sahiptir:

source: Client code is simplified.
es_mx: Se simplifica el código del cliente.
tr: İstemci (client) kodunu yalınlaştırır, basitleştirir.

source: Reduces the chance of null pointer exceptions.
es_mx: Se reduce la probabilidad de excepciones de apuntador nulo.
tr: Boş İşaretçi ayrıklıkları (Null Pointer exceptions) olasılığını azaltır.

source: Fewer conditionals require less test cases.
es_mx: Menos condicionales requieren menos casos de prueba.
tr: Daha az koşul daha az test durum gerektirir.

source: Methods that return an object or null should instead return an object or ``NullObject``. ``NullObject``\ s simplify boilerplate code such as ``if (!is_null($obj)) { $obj->callSomething(); }`` to just ``$obj->callSomething();`` by eliminating the conditional check in client code.
bg: Методите, които връщат обект или null, вместо това трябва да върнат обект или ``NullObject``. ``NullObject``\ s опростяване на кодов шаблон, като ``if (!is_null($obj)) { $obj->callSomething(); }`` to just ``$obj->callSomething();`` чрез премахване на условната проверка в кода.
es_mx: Los métodos que devuelven un objeto o nulo deben en su lugar devolver un objeto u `` ObjetoNulo``. El Objeto Nulo simplifica el código repetitivo como ``if (!is_null($obj)) { $obj->callSomething(); }`` a ``$obj->callSomething();`` eliminando la verificación condicional en el código del cliente.
fr: Les méthodes renvoyant un objet ou null devraient plutôt renvoyer un objet ou ``NullObject``. Les ``NullObjects`` simplifient le code passe-partout tel que ``if (!is_null($obj)) { $obj->callSomething() ; }`` en le remplaçant par ``$obj->callSomething() ; ``en éliminant la vérification conditionnelle dans le code client.
nl: Methoden die een object of null retourneren, moeten in plaats daarvan een object of 'NullObject' retourneren. `` NullObject '' vereenvoudigt standaardcode zoals `ʻif (! Is_null ($ obj)) {$ obj-> callSomething (); } `` gewoon `` $ obj-> callSomething (); '' door de voorwaardelijke check-in clientcode te elimineren.
pl: Metoda, która zwraca obiekt lub null powinna zwracać obiekt lub Obiekt Pusty (``NullObject``). ``NullObject`` w znaczący sposób upraszcza kod z postaci ``if (!is_null($obj)) { $obj->callSomething(); }`` do ``$obj->callSomething();`` poprzez eliminację warunku w kodzie klienta.
pt_br: Métodos que retornam um objeto ou nulo devem ao invés disso, retornar um objeto ou ``NullObject``. ``NullObject``\ é simplesmente código boilerplate como ``if (!is_null($obj)) { $obj->callSomething(); }`` para apenas ``$obj->callSomething();`` eliminando então a checagem condicional no código cliente.
ru: Методы, которые возвращают объект или Null, вместо этого должны вернуть объект ``NullObject``. Это упрощённый формальный код, устраняющий необходимость проверки ``if (!is_null($obj)) { $obj->callSomething(); }``, заменяя её на обычный вызов ``$obj->callSomething();``.

source: Examples
bg: Примери
es_mx: Ejemplos
fr: Exemples
nl: Bijvoorbeeld
pl: Przykłady
pt_br: Exemplos
ru: Примеры
tr: Örnekler

source: Symfony2: null logger of profiler.
es_mx: Symfony2: registro de eventos nulo del perfilador.
tr: Symfony2: profilleyiciye (profiler) ait boş kayıtçı (logger).

source: Symfony2: null output in Symfony/Console.
es_mx: Symfony2: salida nula en la consola de Symfony.
tr: Symfony2: Symfony/Console içerisindeki boş çıktı (output).

source: null handler in a Chain of Responsibilities pattern.
es_mx: Manejador nulo en un patrón de Cadena de Responsabilidades.
tr: Bir Yüklenim Zinciri (Chain of Responsibilities) desenindeki boş işleyici (handler).

source: null command in a Command pattern.
es_mx: Comando nulo en un patrón de Comando.
tr: Bir Komut (Command) desenindeki boş komut (command).

source: UML Diagram
bg: UML Диаграма
es_mx: Diagrama UML
fr: Diagramme UML
pl: Diagram UML
pt_br: Diagrama UML
ru: Диаграмма UML
tr: UML Diyagramı

source: Alt NullObject UML Diagram
es_mx: Alt Diagrama UML ObjetoNulo
tr: Alt NullObject UML Diyagramı

source: Code
bg: Код
es_mx: Código
pl: Kod
pt_br: Código
ru: Код
tr: Kod

source: You can also find these code on `GitHub`_
es_mx: Puedes encontrar este código también en `GitHub`_

source: Test
bg: Тест
es_mx: Pruebas
pl: Testy
pt_br: Teste
ru: Тест

source: `Null Object`__
bg: `Празен обект`__
pl: `Pusty obiekt <https://pl.wikipedia.org/wiki/Pusty_Obiekt_(wzorzec_projektowy)>`_ (`Null Object`__)
pt_br: `Objeto Nulo (Null Object)`__
ru: `Объект Null <https://ru.wikipedia.org/wiki/Null_object_(Шаблон_проектирования)>`_ (`Null Object`__)

source: Client code is simplified
bg: Клиентският код е опростен
fr: Le code client est simplifié
nl: Client code is versimpeld
pl: uproszcza kodu programu,
pt_br: Código do cliente é simplificado
ru: Клиентский код упрощается

source: Reduces the chance of null pointer exceptions
bg: Намалява шанса за изключения от нулев указател
fr: Réduit le risque d'exceptions de pointeur ``null``
nl: Verminder kant van null pointer exceptions
pl: zmniejsza prawdopodobieństwo wystąpienia błędu *null pointer exception*,
pt_br: Reduz a chance de exceções de ponto nulo (null pointer exceptions)
ru: Уменьшает шанс исключений из-за нулевых указателей (и ошибок PHP различного уровня)

source: Fewer conditionals require less test cases
bg: По-малко условия изискват по-малко тестови случаи
fr: Moins de conditions exigent moins de cas de test
nl: Minder voorwaarden betekent minder test situaties vereist
pl: eliminuje zbędne lub powtarzające się warunki, które wpływają na zmniejszenie liczby przypadków testowych,
pt_br: Menores condicionais requerem menos casos de teste
ru: Меньше дополнительных условий — значит меньше тесткейсов

source: Symfony2: null logger of profiler
pl: Symfony2: `NullLogger <http://api.symfony.com/2.8/Symfony/Component/HttpKernel/Log/NullLogger.html>`_ w ramach profilera.

source: Symfony2: null output in Symfony/Console
pl: Symfony2: `NullOutput <http://api.symfony.com/2.8/Symfony/Component/Console/Output/NullOutput.html>`_ w ramach komponentu Symfony/Coonsole.

source: null handler in a Chain of Responsibilities pattern
bg: нулев манипулатор в шаблон на верига отговорности
fr: Null handler dans un modèle de chaîne de responsabilités
nl: null handelaar in een Ketting van verantwoordelijkhedenspatroon
pl: Obsługa NULL we wzrocu Łańcuch zobowiązań.
pt_br: manipulador nulo em um padrão de Cadeia de Responsabilidades (Chain of Responsibilities)

source: null command in a Command pattern
bg: нулева команда в Command шаблон
fr: Null command dans un patron Command
nl: null commando in een Commandopatroon
pl: Polecenie NULL we wzorcu Polecenie.
pt_br: commando nulo em um padrão Comando (Command)

source: You can also find this code on `GitHub`_
bg: Можете също да намерите този код в `GitHub`_
fr: Vous pouvez également trouver ce code sur `GitHub`_
nl: Je kan deze broncode terugvinden op `GitHub`_
pl: Ten kod znajdziesz również na `GitHub`_.
pt_br: Você também pode encontrar este código no `GitHub`_
ru: Вы можете найти этот код на `GitHub`_
tr: Bu kodu `Github`_ üzerinde de bulabilirsiniz.

source: Methods that return an object or null should instead return an object or ``NullObject``. ``NullObject`` s simplify boilerplate code such as ``if (!is_null($obj)) { $obj->callSomething(); }`` to just ``$obj->callSomething();`` by eliminating the conditional check in client code.
tr: Bir nesne veya boş (null) döndüren nesneler, bunun yerine yine bir nesne veya ``NullObject`` döndürür. ``NullObject``, istemci kodundaki koşullu kontrolü (if) atarak, yani ``if (!is_null($object)) $object->callSomething()`` yerine yalnızca ``$object->callSomething()`` kısmının kullanılabilmesini sağlayarak, ortak kodu (boilerplate) basitleştirmiştir.

source: Null logger or null output to preserve a standard way of interaction between objects, even if the shouldn't do anything
bg: Null logger или null output за запазване на стандартен начин на взаимодействие между обектите, дори ако не трябва да прави нищо
nl: Null Logger oder Null Output um einen Standardweg einzuhalten, über den Objekte miteinander interagieren auch wenn Objekte nichts tun sollen
pt_br: Log nulo ou saída nula para preservar uma forma padrão de interação entre objetos, mesmo que não devam fazer nada

source: null logger or null output to preserve a standard way of interaction between objects, even if the shouldn't do anything
fr: Null logger ou null output pour préserver un mode d'interaction standard entre les objets, même s'ils ne devraient rien faire.
