Repository: DesignPatternsPHP/DesignPatternsPHP
Catalog: locale/*/LC_MESSAGES/Structural/Composite/README.po
Languages: tr

source: Composite
tr: Composite (Bileşik)

source: Purpose
tr: Amaç

source: To treat a group of objects the same way as a single instance of the object.
tr: Bir gruptaki nesnelerin tümüne, tek bir nesne örneğiymiş (instance) gibi davranmak.

source: Examples
tr: Örnekler

source: a form class instance handles all its form elements like a single instance of the form, when ``render()`` is called, it subsequently runs through all its child elements and calls ``render()`` on them
tr: Bir form sınıfı örneği, tüm alt ögelerini (child element) tek bir form örneğiymiş gibi ele alır. Ne zaman ``render()`` yöntemi çağrılsa, peşi sıra tüm alt ögelerin ``render()`` yöntemini çağrırır.

source: ``Zend_Config``: a tree of configuration options, each one is a ``Zend_Config`` object itself
tr: ``Zend_Config``: Bir yapılandırma seçenekleri dizisidir (configuration options). Dizi ögelerinin her biri de, özünde yine bir ``Zend_Config`` nesnesidir.

source: UML Diagram
tr: UML Diyagramı

source: Alt Composite UML Diagram
tr: Alt Composite UML Diyagramı

source: Code
tr: Kod

source: You can also find this code on `GitHub`_
tr: Bu kodu `Github`_ üzerinde de bulabilirsiniz.
