Repository: DesignPatternsPHP/DesignPatternsPHP
Catalog: locale/*/LC_MESSAGES/Structural/Facade/README.po
Languages: bg, de, es_mx, pl, pt_br, ru, tr, zh_cn

source: Facade
es_mx: Fachada
tr: Facade (Önyüz)

source: Purpose
bg: Предназначение
de: Zweck
es_mx: Propósito
pl: Przeznaczenie
pt_br: Objetivo
ru: Назначение
tr: Amaç
zh_cn: 目的

source: The primary goal of a Facade Pattern is not to avoid you to read the manual of a complex API. It's only a side-effect. The first goal is to reduce coupling and follow the Law of Demeter.
de: Das primäre Ziel des Facade-Musters ist nicht, dir das Lesen von komplexen API Dokumentationen zu ersparen. Das kann ein Seiteneffekt sein. Es ist vielmehr das Ziel, Kopplungen zu vermeiden und dem Gesetz von Demeter zu folgen.
es_mx: El principal objetivo del patrón de Fachada no es evitar que se lean manuales complejos de una API, es solamente un efecto secundario. El principal objetivo es reducir el acoplamiento y cumplir la Ley de Demeter.
ru: Основная цель паттерна Фасад заключается не в том, чтобы помешать вам прочитать инструкцию комплексной API. Это только побочный эффект. Главная цель всё же состоит в уменьшении связности кода и соблюдении `Закона Деметры <https://ru.wikipedia.org/wiki/Закон_Деметры>`_.
tr: Önyüz deseninin öncelikli amacı, karmaşık bir API kullanım kılavuzunun okumasından kaçınmak değildir. Bu sadece bir yan etkidir. Birinci hedef, bağlantıları ayrıştırmak ve Demeter Yasasını (Law of Demeter) takip etmektir.
zh_cn: 外观模式的目标并不是让你不去了解复杂的子系统的接口，这恰好是外观模式的负效应。外观模式的第一目标是松耦合和遵守迪米特法则。

source: A Facade is meant to decouple a client and a sub-system by embedding many (but sometimes just one) interface, and of course to reduce complexity.
bg: Фасадата има за цел да отдели клиент и подсистема чрез вграждане на много (но понякога само един) интерфейс и, разбира се, да намали сложността.
de: Eine Facade dient dazu, den Client von einem Subsystem zu entkopplen, indem ein oder mehrere Interfaces einzuführen und damit Komplexität zu verringern.
es_mx: Una Fachada está destinada a desacoplar un cleinte y un subsistema mediante la incorporación de muchas interfaces (aunque muchas veces solamente una) y por supuesto reducir la complejidad.
pl: Fasada pozwala oddzielić klienta od podsystemu, poprzez udostępnienie jednego lub wielu interfejsów oraz zredukować złożoność rozwiązania.
pt_br: Uma Facade destina-se a dissociar um cliente e um subsistema, incorporando muitas (porém as vezes apenas uma) interface e, é claro, para reduzir a complexidade.
ru: Фасад предназначен для разделения клиента и подсистемы путем внедрения многих (но иногда только одного) интерфейсов, и, конечно, уменьшения общей сложности.
tr: Bir önyüz, bir veya birden fazla arayüzü gömerek (interface injection) bir istemci ve bir alt sistemi ayrıştırmak ve tabii ki karmaşıklığı azaltmak içindir.
zh_cn: 外观模式意味着解耦了使用者和子系统的耦合，通过增加大量接口的方式（通常只是一个接口），当然，这样做减少了使用者的使用复杂度。

source: A facade does not forbid you the access to the sub-system
bg: Фасадата не ви забранява достъпа до подсистемата
de: Eine Facade verbietet nicht den Zugriff auf das Subsystem
es_mx: Una Fachada no impide el acceso al subsistema
pl: Fasada nie zabrania bezpośredniego dostępu do podsystemu.
pt_br: Uma Facade não proibe você de acessar o sub-sistema
ru: Фасад не запрещает прямой доступ к подсистеме. Просто он делает его проще и понятнее.
tr: Bir önyüz alt sisteme erişimi yasaklamaz.
zh_cn: 外观模式不是要求你不需要去了解子系统.

source: You can (you should) have multiple facades for one sub-system
bg: Можете (трябва) да имате множество фасади за една подсистема
de: Es ist nicht unüblich, mehrere Fassaden für ein Subsystem zu implementieren
es_mx: Se puede (se debería) tener múltiples fachadas ára un subsistema
pl: Dobrym pomysłem jest posiadanie wielu fasad do jednego podsystemu.
pt_br: Você pode (você deve) ter múltiplas facades para um sub-sistema
ru: Вы можете (и вам стоило бы) иметь несколько фасадов для одной подсистемы.
tr: Bir alt sistem için birden fazla önyüze sahip olabilirsiniz (olmalısınız).
zh_cn: 你可以（应该）为一个子系统设计多个外观。

source: That's why a good facade has no ``new`` in it. If there are multiple creations for each method, it is not a Facade, it's a Builder or a [Abstract\|Static\|Simple] Factory [Method].
bg: Ето защо добрата фасада няма ``new`` в себе си. Ако има множество творения за всеки метод, това не е Facade, това е Builder или [Abstract\|Static\|Simple] Factory [Method].
de: Deshalb besitzt eine gute Facade keine ``new`` Aufrufe. Falls es mehrere Erzeugungsmethoden pro Methode gibt, handelt es sicht nicht um eine Facade, sondern um einen Builder oder [Abstract\|Static\|Simple] Factory [Method].
es_mx: Esto es por lo que una buena Fachada no tiene ``new`` en ella. Si existen múltiples creaciones para cada método entonces no es una Fachada, es un Constructor o una Fábrica [Abstracta\|Estática\|Simple] o un Método Fábrica.
pl: Dlatego dobra fasada nie tworzy nowych obiektów, tylko korzysta z istniejących (nie używa operatora ``new``). Jeżeli w ramach fasady tworzymy wiele obiektów, w ramach każdej metody, wtedy nie mamy do czynienia z Fasadą, tylko z Budowniczym lub formą Fabryki.
pt_br: É por isso que uma boa facade não tem nenhum ``new`` nela. Se há multiplas criações para cada método, ela não é uma facade, ela é uma Builder (Construtora) ou uma [Abstract\|Static\|Simple] Factory (Fábrica) [Method].
ru: Вот почему хороший фасад не содержит созданий экземпляров классов (``new``) внутри. Если внутри фасада создаются объекты для реализации каждого метода, это не Фасад, это Строитель или [Абстрактная\|Статическая\|Простая] Фабрика [или Фабричный Метод].
zh_cn: 这就是为什么好的外观模式的实现没有 ``new`` 操作。如果外观模式的实现里每个方法都有多个对象的创建，那么它就不能称作外观模式的实现，它应该叫做生成器或者一个[抽象\|静态\|简单] 工厂 [方法].

source: The best facade has no ``new`` and a constructor with interface-type-hinted parameters. If you need creation of new instances, use a Factory as argument.
bg: Най-добрата фасада няма ``new`` и конструктор с interface-type-hinted параметри. Ако се нуждаете от създаване на нови копия, използвайте Factory като аргумент.
de: Bestenfalls besitzt eine Facade kein ``new`` und einen Konstruktor mit Type-Hints als Parameter. Falls du neue Instanzen erzeugen willst, kannst du eine Factory als Argument verwenden.
es_mx: La mejor Fachada no tiene ``new`` y un constructor con parámetros con tipos especificados por interfaz. Si se necesita la creación de nuevas instancias, se debe utilizar una Fábrica como argumento.
pl: W ramach Fasady najlepiej nie używać operatora ``new`` oraz definiować typy argumentów konstruktora (`type-hinting`). Jeżeli potrzebujemy stworzyć nowe obiekty, powinniśmy przekazać Fabrykę jako argument.
pt_br: A melhor facade não tem nenhum ``new`` e um construtor com parâmetros interface-type-hinted. Se você precisa da criação de novas instâncias, use uma Factory (Fábrica) como argumento.
ru: Лучший фасад не содержит ``new`` или конструктора с type-hinted параметрами. Если вам необходимо создавать новые экземпляры классов, в таком случае лучше использовать Фабрику в качестве аргумента.
tr: En iyi önyüz ``new`` içermeyen ve kurucusu (constructor) arayüz türü ipuçlanarak (interface-type-hinted) parametrize edilmiş olandır. Şayet yeni örnekler (instance) oluşturmanız gerekiyorsa, argüman olarak bir Fabrika (Factory) kullanın.
zh_cn: 最好的外观模式的实现没有带有一个有类型限定的构造参数的 ``new`` 操作。如果你需要在外观模式中创建了一个新实例，使用创建型的工厂方法来生成参数。

source: UML Diagram
bg: UML Диаграма
de: UML Diagramm
es_mx: Diagrama UML
pl: Diagram UML
pt_br: Diagrama UML
ru: UML Диаграмма
tr: UML Diyagramı
zh_cn: UML 图

source: Alt Facade UML Diagram
es_mx: Alt Diagrmaa UML Fachada
tr: Alt Facade UML Diyagramı

source: Code
bg: Код
es_mx: Código
pl: Kod
pt_br: Código
ru: Код
tr: Kod
zh_cn: 代码

source: You can also find this code on `GitHub`_
bg: Можете също да намерите този код в `GitHub`_
es_mx: Puedes encontrar este código también en `GitHub`_
pl: Ten kod znajdziesz również na `GitHub`_.
pt_br: Você também pode encontrar este código no `GitHub`_
tr: Bu kodu `Github`_ üzerinde de bulabilirsiniz.

source: Test
bg: Тест
de: Теst
es_mx: Pruebas
pl: Testy
pt_br: Teste
ru: Тест
zh_cn: 测试

source: `Facade`__
bg: `Фасада`__
pl: `Fasada <https://pl.wikipedia.org/wiki/Fasada_(wzorzec_projektowy)>`_ (`Facade`__)
pt_br: `Facade (Fachada)`__
ru: `Фасад <https://ru.wikipedia.org/wiki/Фасад_(шаблон_проектирования)>`_ (`Facade`__)
zh_cn: `外观`__

source: The primary goal of a Facade Pattern is not to avoid you having to read the manual of a complex API. It's only a side-effect. The first goal is to reduce coupling and follow the Law of Demeter.
bg: Основната цел на фасаден шаблон не е да не ви се налага да четете ръководството на сложен API. Това е само страничен ефект. Първата цел е да се намали връзката и да се следва закона на Деметра (Law of Demeter).
pt_br: O principal objetivo de um Facade Pattern não é evitar que você tenha que ler o manual de uma API complexa. É apenas um efeito colateral. O primeiro objetivo é reduzir o acoplamento e seguir a Lei de Demeter.

source: The primary goal of a Facade Pattern is not to avoid you having to read themanual of a complex API. It's only a side-effect. The first goal is toreduce coupling and follow the Law of Demeter.
pl: Głównym celem wzorca Fasady jest udostępnienie prostego interfejsu do złożonego systemu - dzięki czemu nie trzeba znać obszernej dokumentacji API. Takie podejście redukuje powiązania pomiędzy klasami i umożliwia przestrzeganie `prawa Demeter <https://pl.wikipedia.org/wiki/Prawo_Demeter>`_.

source: You can also find these code on `GitHub`_
de: Du findest den Code auch auf `GitHub`_
ru: Вы можете найти этот код на `GitHub`_
zh_cn: 你可以在 `GitHub`_ 上找到这些代码

source: That's why a good facade has no ``new`` in it. If there are multiple creations for each method, it is not a Facade, it's a Builder or a [Abstract|Static|Simple] Factory [Method].
tr: İyi tasarlamış bir önyüzde ``new`` diye bir şey olmamasının nedeni budur. Her yöntem için birden fazla oluşturum varsa (multiple creation), bu artık bir Önyüz değil, bir Yapıcı (Builder) ya da [Soyut (Abstract)|Statik (Static)|Basit (Simple)] Fabrika (Factory) [Yöntem (Method)] olur.
