Repository: DesignPatternsPHP/DesignPatternsPHP
Catalog: locale/*/LC_MESSAGES/Creational/Singleton/README.po
Languages: bg, de, es, es_mx, pl, pt_br, ru, tr, zh_cn

source: `Singleton`__
bg: `Сек`__
pl: `Singleton <https://pl.wikipedia.org/wiki/Singleton_(wzorzec_projektowy)>`_ (`Singleton`__)
ru: `Одиночка <https://ru.wikipedia.org/wiki/Одиночка_(шаблон_проектирования)>`_ (`Singleton`__)
zh_cn: `单例模式`__

source: **THIS IS CONSIDERED TO BE AN ANTI-PATTERN! FOR BETTER TESTABILITY AND MAINTAINABILITY USE DEPENDENCY INJECTION!**
bg: ** ТОВА СЧИТА СЕ ЗА АНТИ-ШАБЛОН (anti-pattern)! ЗА ПО-ДОБРА ПРОВЕРИМОСТ И ПОДДЪРЖАЕМОСТ ИЗПОЛЗВАЙТЕ ИНЖЕКЦИЯ НА ЗАВИСИМОСТ! **
de: **DIESES MUSTER IST EIN ANTI-PATTERN! FÜR BESSERE TESTBARKEIT UND WARTBARKEIT, VERWENDE DAS DEPENDENCY INJECTION MUSTER!**
es: **ESTO ES CONSIDERADO UN ANTI-PATRÓN. PARA MEJOR TESTEABILIDAD Y MANTENIBILIDAD USA INYECCIÓN DE DEPENDENCIAS**
es_mx: ****¡ESTE ES CONSIDERADO COMO UN ANTI-PATRÓN! PARA UNA MEJOR CAPACIDAD DE PRUEBAS Y MANTENIMIENTO UTILIZA INYECCIÓN DE DEPENDENCIAS!**
pl: **TEN WZORZEC PROJEKTOWY JEST UZNAWANY ZA ANTY-WZORZEC! DLA LEPSZEGO TESTOWANIA I ŁATWIEJSZEGO UTRZYMANIA STOSUJĄC TEN WZORZEC POWINIENEŚ STOSOWAĆ TAKŻE WZORZEC WSTRZYKIWANIA ZALEŻNOŚCI (DEPENDENCY INJECTION)!**
pt_br: **CONSIDERADO UM ANTI-PATTERN! PARA MELHOR TESTABILIDADE E MANUTENIBILIDADE USE INJEÇÃO DEPENDÊNCIAS!**
ru: **Это считается анти-паттерном! Для лучшей тестируемости и сопровождения кода используйте Инъекцию Зависимости (Dependency Injection)!**
tr: **BU DESEN ANTI-PATTERN OLARAK NİTELENDİRİLMİŞTİR, DAHA İYİ BİR TEST EDİLEBİLİRLİK (TESTABILITY) VE BAKIM YAPILABİLİRLİK (MAINTAINABILITY) İÇİN BAĞIMLILIK ENJEKSİYONU (DEPENDENCY INJECTION) KULLANINIZ!**
zh_cn: **单例模式已经被考虑列入到反模式中！请使用依赖注入获得更好的代码可测试性和可控性！**

source: Purpose
bg: Предназначение
de: Zweck
es: Proposito
es_mx: Propósito
pl: Przeznaczenie
pt_br: Objetivo
ru: Назначение
tr: Amaç
zh_cn: 目标

source: To have only one instance of this object in the application that will handle all calls.
bg: Да има само един екземпляр на този обект в приложението, който да обработва всички повиквания.
de: Um nur eine einzelne Instanz eines Objekts in der Anwendung zu verwenden, die alle Aufrufe abarbeitet.
es: Tener una única instancia de este objeto en la aplicación que pueda encargarse de todas las llamadas.
es_mx: Tener solamente una instancia de este objeto en la aplicación que atenderá todas las llamadas.
pl: Umożliwia stworzenie tylko jednej instancji obiektu danej klasy. Tylko ten obiekt będzie używany w ramach całej aplikacji.
pt_br: Ter uma única instância da classe na aplicação que será responsável por gerenciar todas as chamadas a ela.
ru: Позволяет содержать только один экземпляр объекта в приложении, которое будет обрабатывать все обращения, запрещая создавать новый экземпляр.
tr: Bir uygulamada bir nesnenin yalnızca bir örneğine (instance) ilgili tüm istemleri işletmek.
zh_cn: 使应用中只存在一个对象的实例，并且使这个单实例负责所有对该对象的调用。

source: Examples
bg: Примери
de: Beispiele
es: Ejemplos
es_mx: Ejemplos
pl: Przykłady
pt_br: Exemplos
ru: Примеры
tr: Örnekler
zh_cn: 例子

source: DB Connector
bg: DB конектор
de: DB Konnektor
es: Conexión a la base de datos
es_mx: Conector de Base de Datos
pl: Połączenie do bazy danych.
pt_br: Conexão ao banco de dados (DB Connector)
ru: DB Connector для подключения к базе данных
tr: Veritabanı Bağlantıcısı (Database Connector)
zh_cn: 数据库连接器

source: Logger
bg: Регистратор (logger)

source: Lock file for the application (there is only one in the filesystem ...)
bg: Lock file за приложението (във файловата система има само един ...)
de: Lock file für die Anwendung (falls diese nur einmal auf dem System laufen darf ...)
es: Bloqueo de ficheros para la aplicación ( Solo hay uno en el sistema de ficheros )
es_mx: Un archivo de bloqueo para la aplicación (solamente hay uno en el sistema de archivos...)
pl: Blokowanie pliku - zakładanie locka.
pt_br: Arquivo de lock para a aplicação (existe apenas um em todo o sistema de arquivos ...)
ru: Блокировка файла в приложении (есть только один в файловой системе с одновременным доступом к нему)
tr: Uygulama için kilitleme (lock) dosyası (dosya sisteminde sadece bir tane var ...).
zh_cn: 应用锁文件 （理论上整个应用只有一个锁文件 ...）

source: UML Diagram
bg: UML Диаграма
de: UML Diagramm
es: Diagrama UML
es_mx: Diagrama UML
pl: Diagram UML
pt_br: Diagrama UML
ru: UML Диаграмма
tr: UML Diyagramı
zh_cn: UML 图

source: Code
bg: Код
es: Código
es_mx: Código
pl: Kod
pt_br: Código
ru: Код
tr: Kod
zh_cn: 代码

source: You can also find this code on `GitHub`_
bg: Можете също да намерите този код в `GitHub`_
pl: Ten kod znajdziesz również na `GitHub`_.
pt_br: Você também pode encontrar esse código no `GitHub`_
ru: Вы можете найти этот код на `GitHub`_
tr: Bu kodu `Github`_ üzerinde de bulabilirsiniz.

source: Test
bg: Тест
de: Теst
es_mx: Pruebas
pl: Testy
pt_br: Teste
ru: Тест
zh_cn: 测试

source: Logger (may also be a Multiton if there are many log files for several purposes)
de: Logger (kann auch ein Multiton sein, falls es mehrere Logfiles für verschiedene Zwecke gibt)
es: Logger ( también podría ser un Multiton si hay varios ficheros de log para diferentes propósitos )
es_mx: Registrador de Eventos (puede ser también un Multiton si hay archivos de registro de eventos para diferentes propósitos)
pl: Logger - można do tego wykorzystać również wzorzec Multitona.
pt_br: Logger (pode ser necessário um Multiton se houverem mais de um arquivo de log para diferentes necessidades
ru: Logger (также может быть Multiton если есть много журналов для нескольких целей)
tr: Kayıtçı (Logger) (çeşitli amaçlara yönelik çok sayıda kayıt dosyası varsa, bu aynı zamanda bir Çoğullama (Multiton) da olabilir).
zh_cn: 日志记录器 （可能有多个实例，比如有多个日志文件因为不同的目的记录不同到的日志）

source: Alt Singleton UML Diagram
es_mx: Alt Diagrama UML Singleton
tr: Alt Singleton UML Diyagramı

source: You can also find these code on `GitHub`_
de: Du findest den Code auch auf `GitHub`_
es: Puedes ver este código en `GitHub`_
es_mx: Puedes encontrar este código también en `GitHub`_
zh_cn: 你可以在 `GitHub`_ 上找到这些代码

source: Singleton
tr: Singleton (Tekilleme)
