Repository: DesignPatternsPHP/DesignPatternsPHP
Catalog: locale/*/LC_MESSAGES/Behavioral/TemplateMethod/README.po
Languages: bg, es_mx, pl, pt_br, ru, tr

source: Template Method
es_mx: Método Plantilla
tr: Template Method (Şablon Yöntemi)

source: Purpose
bg: Предназначение
es_mx: Propósito
pl: Przeznaczenie
pt_br: Objetivo
ru: Назначение
tr: Amaç

source: Template Method is a behavioral design pattern.
bg: Шаблонен метод е поведенчески шаблон за дизайн.
es_mx: Método Plantilla es un patrón de diseño de comportamiento.
pl: Metoda szablonowa jest czynnościowym wzorcem projektowym.
pt_br: Método Modelo é um Padrão de Projeto Comportamental.
ru: Шаблонный метод, это поведенческий паттерн проектирования.
tr: Alt sınıflar içerisinde kullanılabilecek yöntemleri üst sınıf içerisinde tanımlayarak, kopyala-yapıştır işlemini azaltıp, gereksiz kod yoğunluğunu önlemek.

source: Perhaps you have encountered it many times already. The idea is to let subclasses of this abstract template "finish" the behavior of an algorithm.
bg: Може би вече сте го срещали много пъти. Идеята е да се остави подкласовете на този абстрактен шаблон да „довършат“ поведението на алгоритъм.
es_mx: Posiblemente ya hayas encontrado este patrón muchas veces. La idea es dejar que las subclases de esta plantilla abstracta "terminen" el comportamiento de un algoritmo.
pl: Prawdopodobnie spotkałeś się z tym wzorcem wielokrotnie. Jego idea opiera się na implementacji w klasie pochodnej metody z klasy rodzica zdefiniowanej jako abstrakcyjna i tym samym dokończenie działania algorytmu.
pt_br: Talvez você já tenha encontrado ele muitas vezes. A ideia é deixar subclasses deste modelo abstrato "terminar" o comportamento de um algoritmo.
ru: Возможно, вы сталкивались с этим уже много раз. Идея состоит в том, чтобы позволить наследникам абстрактного шаблона переопределить поведение алгоритмов родителя.
tr: Belki de bununla pek çok kez karşılamışsınızdır zaten. Aslında fikir, bu soyut şablonun alt sınıflarının bir algoritmanın davranışını "bitirmesini" sağlamaktır.

source: A.k.a the "Hollywood Principle": "Don't call us, we call you." This class is not called by subclasses but the inverse. How? With abstraction of course.
es_mx: También conocido como "El Principio Hollywood": "No nos llames, nosotros te llamaremos." Esta clase no es llamada por las subclases, sino a la inversa. ¿Cómo? Con abstracción claramente.
tr: Örneğin Hollywood İlkesi (Hollywood Principle): "Siz bizi aramayın, biz sizi ararız.". İşin özü, çoğunlukla bu sınıfın alt sınıfların çoğu çağrıya cevap vermez, bizzat kendisi cevap verir. Peki nasıl? Tabii ki de soyutlama (abstraction) yoluyla.

source: In other words, this is a skeleton of algorithm, well-suited for framework libraries. The user has just to implement one method and the superclass does the job.
es_mx: En otras palabras, este es un esqueleto del algoritmo, muy adecuado para librerías de *frameworks*. El usuario solamente tiene que implementar un método y la superclase hace el trabajo.
tr: Başka bir deyişle, bu bir iskele algoritmasıdır ve çatı (framework) kütüphaneleri için çok uygundur. Kullanıcı yalnızca bir (veya bir-iki) yöntemi alt sınıfta uygulanımlar (implementation), geri kalan işi ise üst sınıf halleder.

source: It is an easy way to decouple concrete classes and reduce copy-paste, that's why you'll find it everywhere.
bg: Това е лесен начин да отделите конкретни класове и да намалите copy-paste, затова ще го намерите навсякъде.
es_mx: Es una forma fácil para desacoplar clases concretas y reducir el copiado-pegado, es por esto que lo encontrarás en todos lados.
pl: Jest to prosty sposób na rozdzielenie konkretnych klas i zredukowanie powielonych fragmentów kodu metodą kopiuj-wklej. Jest to główny powód, dla którego takie podejście znajdziesz w wielu miejscach.
pt_br: Ele é uma forma fácil de desacoplar classes concretas e reduzir o copia-cola, este é o motivo de encontrar ele em todo lugar.
ru: Это простой способ изолировать логику в конкретные классы и уменьшить копипаст, поэтому вы повсеместно встретите его в том или ином виде.
tr: Bu desenle somut sınıfların ayrışımı kolaylaşır ve kod bünyesindeki kopyala-yapıştır işlemi azalır. Bu yüzden bu desenle her yerde karşılaşabilirsiniz (örn. `OppaAgentAgentCrud <https://github.com/k-gun/oppa/blob/master/src/Agent/AgentCrud.php>`__)).

source: UML Diagram
bg: UML Диаграма
es_mx: Diagrama UML
pl: Diagram UML
pt_br: Diagrama UML
ru: UML Диаграмма
tr: UML Diyagramı

source: Alt TemplateMethod UML Diagram
es_mx: Alt Diagrama UML MétodoPlantilla
tr: Alt TemplateMethod UML Diyagramı

source: Code
bg: Код
es_mx: Código
pl: Kod
pt_br: Código
ru: Код
tr: Kod

source: You can also find these code on `GitHub`_
es_mx: Puedes encontrar este código también en `GitHub`_
ru: Вы можете найти этот код на `GitHub`_

source: Test
bg: Тест
es_mx: Pruebas
pl: Testy
pt_br: Teste
ru: Тест

source: `Template Method`__
bg: `Шаблонен метод`__
pl: `Metoda szablonowa <https://pl.wikipedia.org/wiki/Metoda_szablonowa_(wzorzec_projektowy)>`_ (`Template Method`__)
pt_br: `Método Modelo (Template Method)`__
ru: `Шаблонный Метод <https://ru.wikipedia.org/wiki/Шаблонный_метод_(шаблон_проектирования)>`_ (`Template Method`__)

source: A.k.a the "Hollywood principle": "Don't call us, we call you." This class is not called by subclasses but the inverse. How? With abstraction of course.
bg: А.к.а „холивудският принцип“ ("Hollywood principle"): „Не ни се обаждайте, ние ще ви се обадим“. Този клас не се извиква от подкласове, а обратно. Как? С абстракция разбира се.
pl: Jak w Hollywoodzkim powiedzeniu "Nie dzwoń do nas, my zadzwonimy do Ciebie" klasa zawierająca metodę szablonową nie jest instancjonowana, tylko klasa, która po niej dziedziczy. Jest to możliwe dzięki abstrakcji. W klasie rodzica znajduje się metoda, która wywołuje zaimplementowane metody (w klasie rodzica oznaczone jako abstrakcyjne).
pt_br: Também conhecido como o "Princípio de Hollywood": "Não nos chame, nós chamamos você". Esta classe não é chamada pelas subclasses, mas o inverso. Como? Com abstração do curso.
ru: Как в «Голливудском принципе»: «Не звоните нам, мы сами вам позвоним». Этот класс не вызывается подклассами, но наоборот: подклассы вызываются родителем. Как? С помощью метода в родительской абстракции, конечно.

source: In other words, this is a skeleton of algorithm, well-suited for framework libraries. The user has just to implement one method and the superclass do the job.
bg: С други думи, това е скелет на алгоритъм, подходящ за фреймуърк библиотеки. Потребителят трябва само да напиша един метод и суперкласът свърши работата.
pl: Innymi słowy, klasa zawierająca metodę szablonową jest szkieletem algorytmu. To rozwiązanie świetnie pasuje do różnego rodzaju frameworków. Programista korzystający z takiej klasy musi zaimplementować tylko metodę szablonową a reszta jest realizowana przez klasę rodzica.
pt_br: Em outras palavras, este é um esqueleto de um algoritmo, bem adequado às bibliotecas do framework. O usuário que apenas que implementar um método e a superclasse faz o trabalho.
ru: Другими словами, это каркас алгоритма, который хорошо подходит для библиотек (в фреймворках, например). Пользователь просто реализует уточняющие методы, а суперкласс делает всю основную работу.

source: You can also find this code on `GitHub`_
bg: Можете също да намерите този код в `GitHub`_
pl: Ten kod znajdziesz również na `GitHub`_.
pt_br: Você também pode encontrar este código no `GitHub`_
tr: Bu kodu `Github`_ üzerinde de bulabilirsiniz.
