Repository: DesignPatternsPHP/DesignPatternsPHP
Catalog: locale/*/LC_MESSAGES/Structural/Adapter/README.po
Languages: pt_br, tr

source: `Adapter / Wrapper`__
pt_br: `Adaptador (Adapter / Wrapper)`__

source: Purpose
pt_br: Objetivo
tr: Amaç

source: To translate one interface for a class into a compatible interface. An adapter allows classes to work together that normally could not because of incompatible interfaces by providing its interface to clients while using the original interface.
pt_br: Para adaptar (compatibilizar) uma interface de uma classe a outra interface. Um adapter permite que classes trabalhem juntas quando, normalmente isso não seria possível devido imcompatibilidade, provendo sua interface para seus clientes enquanto usa ainterface original
tr: Bir sınıfın bir arayüzünü uyumlu bir arayüze çevirmek. Bir uyarlayıcı, normalde uyumsuz olan orijinal arayüzleri nedeniyle birlikte çalışamayacak olan nesnelerin, kendi arayüzünü istemcilerin kullanımına sunarak, birlikte çalışmalarını sağlar.

source: Examples
pt_br: Exemplos
tr: Örnekler

source: DB Client libraries adapter
pt_br: Adaptador de bibliotecas clientes de banco de dados
tr: Veritabanı İstemcisi (Database Client) kütüphaneleri içindeki uyarlayıcılar (örn. `OppaAgentAgent <https://github.com/k-gun/oppa/blob/master/src/Agent/Agent.php>`__).

source: using multiple different webservices and adapters normalize data so that the outcome is the same for all
pt_br: usando diversos webservices e adapters para normalizar os dados de modo que a saída seja sempre a mesma
tr: Birden çok ve farklı ağ servisi (web service) ve uyarlayıcısı kullanıldığında, veriler normalleştirildiğinden sonuç herkes için aynıdır.

source: UML Diagram
pt_br: Diagrama UML
tr: UML Diyagramı

source: Code
pt_br: Código
tr: Kod

source: You can also find these code on `GitHub`_
pt_br: Você também pode encontrar este código no `Github`_

source: Test
pt_br: Teste

source: Adapter
tr: Adapter (Uyarlayıcı)

source: Alt Adapter UML Diagram
tr: Alt Adapter UML Diyagramı

source: You can also find this code on `GitHub`_
tr: Bu kodu `Github`_ üzerinde de bulabilirsiniz.
