Repository: DesignPatternsPHP/DesignPatternsPHP
Catalog: locale/*/LC_MESSAGES/Structural/Registry/README.po
Languages: ru, tr

source: `Registry`__
ru: Реестр (Registry)

source: Purpose
ru: Назначение
tr: Amaç

source: To implement a central storage for objects often used throughout the application, is typically implemented using an abstract class with only static methods (or using the Singleton pattern). Remember that this introduces global state, which should be avoided at all times! Instead implement it using Dependency Injection!
ru: Для реализации централизованного хранения объектов, часто используемых во всем приложении, как правило, реализуется с помощью абстрактного класса только c статическими методами (или с помощью шаблона Singleton). Помнте что это вводит глобальное состояние, которого следует избегать. Используйте Dependency Injection вместо Registry.
tr: Uygulama genelinde sıkça kullanılan nesneleri (örn. Yapılandırma (Configuration)) merkezi bir saklama alanında tutmak. Bu sıklıkla statik yöntemlere sahip sınıflar (veya Tekilleme (Singleton) deseni) kullanılarak yapılır. Ancak unutmayın, bu genelgeçer bir durum (global state) ortaya koyar ki, bunu her zaman uygulamaktan kaçınmak gerekir. Bunun yerine, gereklilik hallerinde Bağımlılık Aktarımı (Dependency Injection) kullanılmalıdır.

source: Examples
ru: Примеры
tr: Örnekler

source: Zend Framework 1: ``Zend_Registry`` holds the application's logger object, front controller etc.
ru: Zend Framework 1: ``Zend_Registry`` содержит объект журналирования приложения (логгер), фронт-контроллер и т.д.
tr: Zend Framework 1: ``Zend_Registry`` uygulamanın kayıtçı (logger), ön denetçi (front controller) gibi nesnelerini tutar.

source: Yii Framework: ``CWebApplication`` holds all the application components, such as ``CWebUser``, ``CUrlManager``, etc.
ru: Yii Framework: ``CWebApplication`` содержит все компоненты приложения, такие как ``CWebUser``, ``CUrlManager``, и т.д.
tr: Yii Framework: ``CWebApplication`` uygulamanın ``CWebUser``, ``CUrlManager`` gibi tüm bileşenlerini tutar.

source: UML Diagram
ru: Диаграмма UML
tr: UML Diyagramı

source: Code
ru: Код
tr: Kod

source: You can also find this code on `GitHub`_
ru: Вы можете найти этот код на `GitHub`_
tr: Bu kodu `Github`_ üzerinde de bulabilirsiniz.

source: Test
ru: Тест

source: Registry
tr: Registry (Kayıt)

source: Alt Registry UML Diagram
tr: Alt Registry UML Diyagramı
