Repository: DesignPatternsPHP/DesignPatternsPHP
Catalog: locale/*/LC_MESSAGES/Behavioral/Command/README.po
Languages: de, es_mx, nl, pl, pt_br, ru, tr

source: Command
es_mx: Comando
tr: Command (Komut)

source: Purpose
de: Zweck
es_mx: Propósito
nl: Doel
pl: Przeznaczenie
pt_br: Objetivo
ru: Назначение
tr: Amaç

source: To encapsulate invocation and decoupling.
de: Um Ausführung zu kapseln und Entkopplung zu erreichen.
es_mx: Encapsular la invocación y desacoplamiento.
nl: Om aanroep en ontkoppeling samen te vatten.
pl: Pozwala wydzielić wykonanie określonej czynności w postaci obiektu.
pt_br: Encapsular invocação e desacoplamento.
ru: Инкапсулировать действие и его параметры
tr: İstemi ve istem ayrıştırmasını sarmalamak.

source: We have an Invoker and a Receiver. This pattern uses a "Command" to delegate the method call against the Receiver and presents the same method "execute". Therefore, the Invoker just knows to call "execute" to process the Command of the client. The Receiver is decoupled from the Invoker.
de: Wir haben einen Invoker (Ausführer) und einen Receiver (Empfänger). Dieses Pattern benutzt ein „Command“ um die Ausführung einer Methode and einen Empfänger zu delegieren und eine einheitliche „execute“ Methode bereitzustellen. Damit weiß der Ausführer nur von der „execute“-Methode, um den Befehl auszuführen. Der Empfänger wird dadurch vom Aufrufer entkoppelt.
es_mx: Se tiene un invocador y un receptor. Este patrón usa un "Comando" para delegar la llamada al método contra el Receptor y presenta el mismo método "ejecutar". Por lo tanto, el Invocador solamente sabe que puede llamar a "ejecutar" para procesar el Comando del cliente. El receptor está desacoplado del Invocador.
nl: We hebben een Starter en een Ontvanger. Dit patroon gebruikt een "Commando" om de methodeaanroep aan de ontvanger te delegeren en presenteert dezelfde methode "execute". Daarom weet de Starter gewoon "voer uit" aan te roepen om het commando van de client te verwerken. De Ontvanger is losgekoppeld van de Starter.
pl: Wprowadzamy trzy obiekty: Nadawcę (ang. `Invoker`), Odbiorcę (ang. `Receiver`) i Polecenie (ang. `Command`). Używamy obiektu Polecenia do wykonywania działań na odbiorcy. Dodatkowo wprowadzamy w obiekcie Polecenia metodę `execute()`. Dzięki temu Nadawca wywołuje zawsze tą samą metodę niezależnie od Polecenia, aby przetworzyć żądanie klienta. Nadawca i Odbiorca nie są ze sobą połączeni.
pt_br: Nós temos um Invocador e um Receptor. Este padrão usa um "Comando" para delegar a chamada do método contra o Receptor e apresenta o mesmo método "execute". Portanto, o Invocador sabe apenas chamar "execute" para processar o Comando do cliente. O Receptor é desacoplado do Invocador.
ru: Допустим, у нас есть объекты Invoker (Командир) и Receiver (Исполнитель). Этот паттерн использует реализацию интерфейса «Команда», чтобы вызвать некий метод Исполнителя используя для этого известный Командиру метод «execute()». Командир просто знает, что нужно вызвать метод “execute()”, для обработки команды клиента, не разбираясь в деталях реализации Исполнителя. Исполнитель отделен от Командира.
tr: Bir çağrıcımız (invoker) ve bir çağrı ayrıştırmacımız yani alıcımız (receiver) olsun. Bu desen, bir "Komut" kullanarak alıcıya karşı yöntem çağrısının (method call) atamasını yapar, ve aynı yöntemi ``execute()`` olarak sunar. Böylece çağrıcı, istemcinin (client) komutunu yürütmek için, yalnızca ``execute()`` yöntemini çağıracağını bilir. Alıcı çağrıcıdan ayrışmıştır.

source: The second aspect of this pattern is the undo(), which undoes the method execute(). Command can also be aggregated to combine more complex commands with minimum copy-paste and relying on composition over inheritance.
de: Der zweite Aspekt dieses Musters ist die `undo()` Methode, die die Ausführung der `execute()` Methode rückgängig machen kann. Befehlen können außerdem aggregiert werden, um komplexe Befehle mit minimalem Aufwand und mit Komposition (anstatt Vererbung) zu erstellen.
es_mx: El segundo aspecto de este patrón es el método deshacer(), que deshace el método ejecutar(). El Comando puede ser también agregado para combinar comandos más complejos con un mínimo de copiado-pegado apoyándose de composición sobre herencia.
nl: Het tweede aspect van dit patroon is de undo (), die de methode execute () ongedaan maakt. Commando's kunnen ook worden geaggregeerd om complexere commando's te combineren met een minimum aan kopiëren en plakken en vertrouwen op compositie boven overerving.
pl: Drugi aspektem tego wzorca jest metoda `undo()`, która pozwala cofnąć wywołanie metody `execute()`. Polecenie może agregować inne Polecenia, aby wykonywać bardziej złożone operacje. Dzięki temu minimalizujemy kopiowanie kodu z innych klas i opieramy się bardziej na kompozycji niż dziedziczeniu.
pt_br: O segundo aspecto deste padrão é o desfazer(), o qual desfaz o método execute(). O comando pode ser também agregado para combinar mais comandos complexos com o mínimo copiar-colar e confiando na composição sobre herança.
ru: Вторым аспектом этого паттерна является метод undo(), который отменяет действие, выполняемое методом execute(). Команды также могут быть объединены в более общие команды с минимальным копированием-вставкой и полагаясь на композицию поверх наследования.
tr: Bu desenin ikinci yönü, ``execute()`` yöntemini geri almayı sağlayan ``undo()`` yöntemidir. Komut deseni, daha karmaşık işlemleri gerçekleştirmek için diğer komutları bir araya getirebilir ve bu sayede kodun (diğer nesnelerden) kopyalanmasını en aza indirir, kalıtımdan çok kompozisyona güvenir.

source: Examples
de: Beispiele
es_mx: Ejemplos
nl: Bijvoorbeeld
pl: Przykłady
pt_br: Exemplos
ru: Примеры
tr: Örnekler

source: A text editor : all events are Command which can be undone, stacked and saved.
de: Ein Texteditor: alle Ereignisse sind Befehle, die rückgängig gemacht, gestapelt und gespeichert werden können.
es_mx: Un editor de texto: todos los eventos son Comandos que pueden ser deshechos, apilados y guardados.
nl: Een teksteditor: alle gebeurtenissen zijn Commando's die ongedaan kunnen worden gemaakt, gestapeld en opgeslagen.
pl: Edytor tekstu: wszystkie zdarzenia (ang. `events`) są Poleceniami, które można cofnąć `undo()`, odłożyć na stosie i zapisać.
pt_br: Um editor de texto : todos os eventos são Comando o qual pode ser desfeito, empilhado e salvo.
ru: текстовый редактор: все события являются Командами, которые могут быть отменены, выстроены в определённую последовательность и сохранены.
tr: Bir metin düzenleyici: bütün olaylar (events) geri alınabilen, yığılmış ve kaydedilmiş Komut'lardır.

source: Symfony2: SF2 Commands that can be run from the CLI are built with just the Command pattern in mind.
es_mx: Symfony2: Comandos SF2 que pueden ser ejecutados desde la línea de comandos (CLI) están construidos justamente con el patrón de Comando en mente.
tr: Symfony2: SF2 CLI'dan çalıştırılabilen komutlar, yalnızca Komut deseni düşünülerek oluşturulmuştur.

source: Big CLI tools use subcommands to distribute various tasks and pack them in "modules", each of these can be implemented with the Command pattern (e.g. vagrant).
es_mx: Grandes herramientas CLI utilizan sub-comandos para distribuir varias tareas y empaquetarlas en "módulos", cada uno de estos puede ser implementado con el patrón de Comando (p.ej. vagrant).
tr: Büyük CLI araçları, çeşitli görevleri ayırmak ve bunları "modüller" ile birleştirmek için alt komutları kullanır. Bu alt komutlar, Komut deseni ile uygulanabilir (örn. Vagrant).

source: UML Diagram
de: UML Diagramm
es_mx: Diagrama UML
pl: Diagram UML
pt_br: Diagrama UML
ru: UML Диаграмма
tr: UML Diyagramı

source: Alt Command UML Diagram
es_mx: Alt Diagrama UML Comando
tr: Alt Command UML Diyagramı

source: Code
es_mx: Código
pl: Kod
pt_br: Código
ru: Код
tr: Kod

source: You can also find this code on `GitHub`_
es_mx: Puedes encontrar este código también en `GitHub`_
nl: Je kan deze broncode terugvinden op `GitHub`_
pl: Ten kod znajdziesz również na `GitHub`_.
pt_br: Você também pode encontrar este código no `GitHub`_
tr: Bu kodu `Github`_ üzerinde de bulabilirsiniz.

source: Test
de: Теst
es_mx: Pruebas
nl: Теst
pl: Testy
pt_br: Teste
ru: Тест

source: `Command`__
nl: `Commando`__
pl: `Polecenie <https://pl.wikipedia.org/wiki/Polecenie_(wzorzec_projektowy)>`_ (`Command`__)
pt_br: `Comando (Command)`__
ru: `Команда <https://ru.wikipedia.org/wiki/Команда_(шаблон_проектирования)>`_ (`Command`__)

source: Symfony2: SF2 Commands that can be run from the CLI are built with just the Command pattern in mind
de: Symfony2: Commands die auf der Konsole ausgeführt werden können, werden als Command Muster entwickelt.
pl: Symfony2: Polecenie w Symfony2, które można uruchomić z poziomu konsoli (CLI - ang. `Command Line Interface`) zostały oparte na wzorcu projektowym Polecenie.
pt_br: Symfony2: Comandos do SF2 que podem ser rodados do CLI são construídos com apenas o padrão Comando em mente
ru: Symfony2: SF2 Commands, это команды, которые построены согласно данному паттерну и могут выполняться из командной строки.

source: big CLI tools use subcommands to distribute various tasks and pack them in "modules", each of these can be implemented with the Command pattern (e.g. vagrant)
de: Komplexe Konsolentools bestehen aus Subcommands, um die Aufgaben besser zu modulariseren. Jedes dieser Commands kann als Command-Pattern implementiert werden (z.B. vagrant).
nl: grote console tools maken gebruik van subcommandos om verschillende taken uit te delen en ze verpakken in "modules", elk van deze kan worden gebruikt met de Commando patroon (vb. zwervend)
pl: Rozbudowane narzędzia CLI używają Podpoleceń do rozdzielenia różnych zadań i pozwalają na łączenie ich w moduły. Każdy taki moduł może zostać zaimplementowany przy pomocy wzorca Polecenie (np. Vagrant).
pt_br: grandes ferramentas CLI usam subcomandos para distribuir várias tarefas e empacotá-las em "módulos", cada um deles pode ser implementado com o padrão Comando (p.e. vagrant)
ru: большие утилиты для командной строки (например, Vagrant) используют вложенные команды для разделения различных задач и упаковки их в «модули», каждый из которых может быть реализован с помощью паттерна «Команда».

source: You can also find these code on `GitHub`_
de: Du kannst diesen Code auch auf `GitHub` einsehen_
ru: Вы также можете найти этот код на `GitHub`_
