Repository: DesignPatternsPHP/DesignPatternsPHP
Catalog: locale/*/LC_MESSAGES/Behavioral/Memento/README.po
Languages: bg, es_mx, fr, nl, pl, pt_br, ru, tr

source: `Memento`__
bg: `Спомен`__
nl: `Aandenking`__
pl: `Pamiątka <https://pl.wikipedia.org/wiki/Pami%C4%85tka_(wzorzec_projektowy)>`_ (`Memento`__)
pt_br: `Memento (Lembrança)`__
ru: `Хранитель <https://ru.wikipedia.org/wiki/Хранитель_(шаблон_проектирования)>`_ (`Memento`__)

source: Purpose
bg: Предназначение
es_mx: Propósito
fr: Rôle
nl: Doel
pl: Przeznaczenie
pt_br: Objetivo
ru: Назначение
tr: Amaç

source: It provides the ability to restore an object to it's previous state (undovia rollback) or to gain access to state of the object, without revealingit's implementation (i.e., the object is not required to have a functionto return the current state).
bg: Осигурява възможност за възстановяване на обект в предишното му състояние (отмяна чрез връщане назад) или за получаване на достъп до състоянието на обекта, без да се разкрива изпълнението му (т.е. обектът не трябва да има функция за връщане на текущото състояние).

source: The memento pattern is implemented with three objects: the Originator, a Caretaker and a Memento.
bg: Шаблон е реализиран с три обекта: Originator (Оригинатор), a Caretaker (Пазител) и Memento (Спомен).
es_mx: El patrón Memento es implementado con tres objetos: el Originador, el Portero y el Memento.
fr: Le pattern Memento est mis en œuvre avec trois objets : Originator, Caretaker et un Memento.
nl: Het aandenkenpatroon is geïmplementeerd met drie objecten: de vinder, een verzorger en een aandenken.
pl: Implementacja wzorca Pamiątki składa się z trzech obiektów: Twórca, Opiekun i Pamiątki.
pt_br: O padrão Memento é implementado com três objetos: o Originator, um Caretaker e um Memento.
ru: Шаблон Хранитель реализуется тремя объектами: "Создателем" (originator), "Опекуном" (caretaker) и "Хранитель" (memento).
tr: Anımsatıcı deseninin uygulanımı üç nesne ile yapılır: Anımsatıcı (Memento), Oluşturucu (Originator), Yönetici (Caretaker).

source: Memento – an object that *contains a concrete unique snapshot of state* of any object or resource: string, number, array, an instance of class and so on. The uniqueness in this case does not imply the prohibition existence of similar states in different snapshots. That means the state can be extracted as the independent clone. Any object stored in the Memento should be *a full copy of the original object rather than a reference* to the original object. The Memento object is a "opaque object" (the object that no one can or should change).
bg: Memento - обект, който * съдържа конкретна уникална снимка на състоянието * на всеки обект или ресурс: низ, число, масив, екземпляр на клас и така нататък. Уникалността в този случай не означава забрана за съществуването на подобни състояния в различни моментни снимки. Това означава, че състояние може да бъде извлечено като независим клон. Всеки обект, съхраняван в Memento, трябва да бъде * пълно копие на оригиналния обект, а не препратка * към оригиналния обект. Обектът Memento е „непрозрачен обект“ (обектът, който никой не може или не трябва да променя).
es_mx: Memento (Recuerdo) - un objeto que *contiene una impresión única y concreta del estado* de cualquier objeto o recurso: cadena de texto, número, arreglo, una instancia de alguna clase, etc. La unicidad en este caso no implicia la prohibición existencial de estados similares en diferentes impresiones. Eso significa que el estado puede ser extraído como un clon independiente. Cualquier objeto almacenado en un Memento debe ser *una copia completa del objeto original más que una referencia* al objeto original. El objeto Memento es un "objeto inmutable" (un objeto que nadie puede o debe modificar).
fr: Memento - Objet contenant *un instantané concret et unique de l'état* de tout objet ou ressource : chaîne de caractères, nombre, tableau, instance de classe, etc. L'unicité dans ce cas n'implique pas l'interdiction de l'existence d'états similaires dans différents instantanés. Cela signifie que l'état peut être extrait en tant que clone indépendant. Tout objet stocké dans le Memento doit être une copie complète de l'objet original plutôt qu'une référence à l'objet original. L'objet Mémento est un "objet opaque" (l'objet que personne ne peut ou ne doit modifier).
nl: Aandenking - een object dat *een concrete unieke momentopname van staat* van een object of bron bevat: tekenreeks, getal, reeks, een instantie van klasse enzovoort. Het unieke in dit geval impliceert niet het verbod op het bestaan ​​van vergelijkbare staten in verschillende snapshots. Dat betekent dat de staat kan worden geëxtraheerd als de onafhankelijke kloon. Elk object dat in de Aandenking is opgeslagen, moet * een volledige kopie van het originele object zijn in plaats van een verwijzing * naar het originele object. Het Aandenking-object is een "ondoorzichtig object" (het object dat niemand kan of mag veranderen).
pl: Pamiątka (ang. `Memento`) - obiekt, który zawiera migawkę (ang. `snapshot`) pełnej, unikatowej informacji o stanie obiektu lub zasobu: napisu, liczby, tablicy lub instancji obiektu. Unikatowość w tym przypadku nie zabrania istnienia innych migawek podobnego stanu danego obiektu. Oznacza to, że stan może zostać pobrany z obiektu *Memento* jako niezależny klon. Jeżeli obiekt *Memento* przechowuje inny obiekt, powinien on być kopią pierwotnego obiektu, a nie referencją na niego. Obiekt *Memento* nie jest przezroczysty (`opaque object <https://en.wikipedia.org/wiki/Opaque_data_type>`_), co oznacza, że nikt tego obiektu nie może lub nie powinien zmieniać.
pt_br: Memento - um objeto que *contém um snapshot único e concreto do estado* de qualquer objeto ou recurso: string, número, array, uma instance de classe e assim por diante. A singularidade, neste caso, não implica a proibição da existência de estados semelhantes em diferentes snapshots. Isso significa que o estado pode ser extraído como o clone independente. Qualquer objeto armazenado no Memento deve ser *uma cópia completa do objeto original em vez de uma referência* para o objeto original. O objeto Memento é um "objeto opaco" (o objeto que ninguém pode ou deve mudar).
ru: Хранитель - это объект, который *хранит конкретный снимок состояния* некоторого объекта или ресурса: строки, числа, массива, экземпляра класса и так далее. Уникальность в данном случае подразумевает не запрет на существование одинаковых состояний в разных снимках, а то, что состояние можно извлечь в виде независимой копии. Любой объект, сохраняемый в Хранителе, должен быть *полной копией исходного объекта, а не ссылкой* на исходный объект. Сам объект Хранитель является «непрозрачным объектом» (тот, который никто не может и не должен изменять).
tr: Anımsatıcı - herhangi nesne veya bir kaynağa ait (string, number, array veya instance (bir nesne örneği) gibi) *durumun somut ve özgün (unique) bir kopyasını* içeren nesnedir. Buradaki özgünlük, benzer durumların diğer kopyalarda olmasının yasaklanması gerektiğini göstermez. Yani bu, durumun bağımsız bir klon olarak çıkarılabileceği anlamına gelir. Anımsatıcıda tutulan herhangi bir nesne, *orijinal nesnenin bir referansı değil, onun tam bir kopyası olmalıdır*. Anımsatıcı nesnesi "geçirimsiz (opaque)" bir nesnedir (nesne kimse tarafından değiştirilemez olmalı, değiştirilmemelidir).

source: Originator – it is an object that contains the *actual state of an external object is strictly specified type*. Originator is able to create a unique copy of this state and return it wrapped in a Memento. The Originator does not know the history of changes. You can set a concrete state to Originator from the outside, which will be considered as actual. The Originator must make sure that given state corresponds the allowed type of object. Originator may (but not should) have any methods, but they *they can't make changes to the saved object state*.
bg: Originator - това е обект, който съдържа * действителното състояние на външен обект е строго определен тип *. Originator е в състояние да създаде уникално копие на това състояние и да го върне увито в спомен. Originator не знае историята на промените. Можете да зададете конкретно състояние на Originator отвън, което ще се счита за действително. Originator трябва да се увери, че дадено състояние съответства на разрешения тип обект. Originator може (но не трябва) да има някакви методи, но те * не могат да правят промени в състоянието на запазения обект *.
es_mx: Originador - es un objeto que contiene *el estado actual de un objeto externo de un tipo estrictamente especificado*. El originador puede crear una copia única de este estado y devolverla envuelta en un Memento. El originador no conoce el historial de cambios. Se puede establecer un estado conreto al originador desde fuera, que será considerado como el actual. El originador debe asegurarse que el estado corresponde con el tipo de objeto permitido. El originador puede (sin ser forzoso) tener cualquier método, pero *no deben hacer cambios al estado del objeto guardado*.
fr: Originator - Objet contenant l'état réel d'un objet externe de type strictement spécifié. L'Originator est capable de créer une copie unique de cet état et de la renvoyer enveloppée dans un Memento. L'Originator ne connaît pas l'historique des changements. Vous pouvez définir un état concret pour l'Originator depuis l'extérieur, qui sera considéré comme réel. L'Originator doit s'assurer que l'état donné correspond au type d'objet autorisé. L'Originator peut (mais ne doit pas) avoir des méthodes, mais elles ne peuvent pas modifier l'état de l'objet sauvegardé.
nl: Vinder - het is een object dat de * werkelijke status van een extern object bevat, is strikt gespecificeerd type *. De maker kan een unieke kopie van deze staat maken en deze verpakt in een aandenken retourneren. De vinder kent de geschiedenis van veranderingen niet. U kunt van buitenaf een concrete toestand instellen op Vinder, die als werkelijk wordt beschouwd. De Beller moet ervoor zorgen dat de gegeven status overeenkomt met het toegestane type object. De maker kan (maar zou niet moeten) methoden hebben, maar ze * ze kunnen geen wijzigingen aanbrengen in de opgeslagen objectstatus *.
pl: Twórca (ang. `Originator`) - obiekt, który zawiera *faktyczny stan zewnętrznego obiektu o określonym typie*. Twórca jest w stanie stworzyć kopię stanu zewnętrznego obiektu i zwrócić go opakowanego w Pamiątkę. Twórca nie posiada informacji o historii zmian, natomiast można mu przekazać stan jaki ma zostać ustawiony zewnętrznemu obiektowi, który będzie traktowany jako aktualny. Twórca jest odpowiedzialny za sprawdzenie czy przekazany stan może zostać ustawiony zewnętrznemu obiektowi, sprawdzając jego typ. Twórca może posiadać, choć nie powinien, dodatkowe metody, ale te *nie mogą zmieniać stanu zewnętrznego obiektu*. Może je jedynie przywrócić z Pamiątki.
pt_br: Originator - é um objeto que contém o *estado atual de um objeto externo é estritamente o tipo especificado*. Originator é capaz de criar uma cópia única deste estado e devolvê-lo envolto em um Memento. O O Originator não conhece a história das mudanças. Você pode definir um estado concreto ao Originator do lado de fora, que será considerado como atual. O Originator deve certificar-se de que determinado estado corresponde ao tipo permitido de objeto. Originator pode (mas não deve) ter quaisquer métodos, mas eles *não podem fazer alterações no estado do objeto salvo*.
ru: Создатель — это объект, который *содержит в себе актуальное состояние внешнего объекта строго заданного типа* и умеет создавать уникальную копию этого состояния, возвращая её, обёрнутую в объект Хранителя. Создатель не знает истории изменений. Создателю можно принудительно установить конкретное состояние извне, которое будет считаться актуальным. Создатель должен позаботиться о том, чтобы это состояние соответствовало типу объекта, с которым ему разрешено работать. Создатель может (но не обязан) иметь любые методы, но они *не могут менять сохранённое состояние объекта*.
tr: Oluşturucu - *türü kesin olarak belirlenmiş harici bir nesnenin gerçek durumunu* içeren nesnedir. Oluşturucu, bu durumun özgün bir kopyasını oluşturabilir ve sarmalanmış (wrapped) bir biçimde anımsatıcıya döndürebilir. Oluşturucu değişikliklerin geçmişini bilmez. Güncel olarak alınacak soyut bir durum dışarıdan yani oluşturucu içerisinde belirlenebilir. Oluşturucu, verilen durumun izin verilen nesne türüyle uyumlu olduğundan emin olmalıdır. Oluşturucu, herhangi bir yönteme (method) sahip olabilir (olmayabilir de), ancak *bu yöntemler nesnenin kayıtlı durumunda değişiklikler yapamaz*.

source: Caretaker *controls the states history*. He may make changes to an object; take a decision to save the state of an external object in the Originator; ask from the Originator snapshot of the current state; or set the Originator state to equivalence with some snapshot from history.
bg: Caretaker * контролира историята на състояния *. Той може да прави промени в обект; взима решение за запазване на състоянието на външен обект в Originator; поиска моментна снимка на текущото състояние от Originator; или зададе състоянието на Originator еквивалентно на някаква снимка от историята.
es_mx: Portero - controla el historial de estados. El puede realizar cambios sobre un objeto; tomar la decisión de guardar el estado de un objeto externo en el originador, solicitar al originador la impresión del estado actual o establecer el estado del originador a una impresión equivalente del historial.
fr: Caretaker - Objet contrôlant l'historique des états. Il peut apporter des modifications à un objet, prendre la décision de sauvegarder l'état d'un objet externe dans l'Originator, demander à l'Originator un instantané de l'état actuel, ou mettre l'état de l'Originator en équivalence avec un instantané de l'histoire.
nl: Verzorger * beheert de geschiedenis van de staten *. Hij kan wijzigingen aanbrengen in een object; een beslissing nemen om de staat van een extern object op te slaan in de Vinder; vraag aan de momentopname van de maker van de huidige staat; of stel de Vinder-status in op gelijkwaardigheid met een momentopname uit de geschiedenis.
pl: Opiekun (ang. `Caretaker`) - obiekt, który zarządza historią stanów obiektu. Może wprowadzać zmiany w obiekcie, zapisywać historię zewnętrznego obiektu poprzez Twórcę, prosić Twórcę o stworzenie Pamiątki (migawki stanu zewnętrznego obiektu) lub prosić Twórcę o ustawienie stanu zewnętrznego obiektu poprzez wskazanie Pamiątki z zachowanej historii.
pt_br: Caretaker *controla a história dos estados*. Ele pode fazer alterações em um objeto; tomar uma decisão para salvar o estado de um objeto externo no Originator; pedir a partir do snapshot do Originator do estado atual ou definir o estado do Originator para equivalência com algum snapshot do histórico.
ru: Опекун *управляет историей снимков состояний*. Он может вносить изменения в объект, принимать решение о сохранении состояния внешнего объекта в Создателе, запрашивать от Создателя снимок текущего состояния, или привести состояние Создателя в соответствие с состоянием какого-то снимка из истории.
tr: Yönetici - değişikliklerin geçmişini kontrol eder. Bir nesnede değişiklik yapabilir, harici bir nesnenin durumunu oluşturucuya kaydetmek için karar alabilir, güncel durumun bir kopyasını oluşturucudan isteyebilir, veya geçmişten bir kopyanın durumu ile eşdeğer olarak oluşturucunun durumunu belirleyebilir.

source: Examples
bg: Примери
es_mx: Ejemplos
fr: Exemples
nl: Bijvoorbeeld
pl: Przykłady
pt_br: Exemplos
ru: Примеры
tr: Örnekler

source: The seed of a pseudorandom number generator
bg: To seed генератор на псевдослучайни числа
fr: La source d'un générateur de nombres pseudo-aléatoires
nl: Het zaad van een pseudo-willekeurige nummergenerator
pl: `Ziarno (ang. seed) <https://en.wikipedia.org/wiki/Random_seed>`_ generatora liczb pseudolosowych.
pt_br: A semente de um gerador de números pseudo-aleatórios
ru: `Зерно <http://en.wikipedia.org/wiki/Random_seed>`_ генератора псевдослучайных чисел.

source: The state in a finite state machine
bg: Състоянието в краен автомат
fr: L'état dans une machine à états finis
nl: De staat in een beperkte toestandsmachine
pl: Stan `automatu skończonego <https://pl.wikipedia.org/wiki/Automat_sko%C5%84czony>`_.
pt_br: O estado em uma máquina de estados finitos
ru: Состояние конечного автомата

source: Control for intermediate states of `ORM Model <http://en.wikipedia.org/wiki/Object-relational_mapping>`_ before saving
bg: Контрол за междинни състояния на `ORM Model <http://en.wikipedia.org/wiki/Object-relational_mapping>`_ преди запазване
fr: Contrôle des états intermédiaires du `modèle ORM <http://en.wikipedia.org/wiki/Object-relational_mapping>` avant la sauvegarde
nl: Controle voor tussenliggende toestanden van ʻORM Model <https://nl.wikipedia.org/wiki/Objectgeori%C3%ABnteerd> `_ alvorens op te slaan
pl: Kontrola stanów pośrednich `modelu ORM <https://pl.wikipedia.org/wiki/Mapowanie_obiektowo-relacyjne>`_.
pt_br: Controle para estados intermediários de `ORM Model <https://pt.wikipedia.org/wiki/Mapeamento_objeto-relacional>`_ antes de salvar
ru: Контроль промежуточных состояний модели в `ORM <http://en.wikipedia.org/wiki/Object-relational_mapping>`_ перед сохранением

source: UML Diagram
bg: UML Диаграма
es_mx: Diagrama UML
fr: Diagramme UML
pl: Diagram UML
pt_br: Diagrama UML
ru: UML Диаграмма
tr: UML Diyagramı

source: Code
bg: Код
es_mx: Código
pl: Kod
pt_br: Código
ru: Код
tr: Kod

source: You can also find this code on `GitHub`_
bg: Можете също да намерите този код в `GitHub`_
es_mx: Puedes encontrar este código también en `GitHub`_
fr: Vous pouvez également trouver ce code sur `GitHub`_
nl: Je kan deze broncode terugvinden op `GitHub`_
pl: Ten kod znajdziesz również na `GitHub`_.
pt_br: Você também pode encontrar este código no `GitHub`_
ru: Вы можете найти этот код на `GitHub`_
tr: Bu kodu `Github`_ üzerinde de bulabilirsiniz.

source: Test
bg: Тест
es_mx: Pruebas
pl: Testy
pt_br: Teste
ru: Тест

source: It provides the ability to restore an object to it's previous state (undo via rollback) or to gain access to state of the object, without revealing it's implementation (i.e., the object is not required to have a function to return the current state).
es_mx: Provee la capacidad de restaurar un objeto a su estado anterior (deshacer a través de *rollback*) u obtener acceso al estado del objeto sin revelar su implementación (p.ej. el objeto no requiere tener una función para devolver el estado actual).
pl: Implementacja tego wzorca umożliwia przywrócenie obiektu do poprzedniego stanu (poprzez wycofanie zmian) lub uzyskaniu dostępu do stanu obiektu bez wiedzy na temat wewnętrznej implementacji obiektu (w sytuacji, gdy na przykład obiekt nie posiada metody pozwalającej na zwrócenie jego stanu).
pt_br: Ele provê a habilidade de restaurar um objeto para seu estado anterior (desfazer via rollback) ou ganhar acesso ao estado do objeto sem revelar sua implementação (p.e. o objeto não é obrigado a ter uma funcionalidade para retornar ao estado atual).
tr: Bir nesnenin, önceki durumuna (state) geri döndürülmesine (geri alarak başa döndürme (undo via rollback)) veya o anki durumuna erişilmesine olanak sağlamak. Ancak bunu gerçekleştirirken, o nesnenin uygulanımını (implementation) göstermez (yani nesne, güncel durumu geri döndürecek bir yöntem (method) içermek zorunda değildir).

source: The seed of a pseudorandom number generator.
es_mx: La semilla de un generador de números aleatorios.
tr: Bir rastgele (random) sayı üretecinin kaynağı (seed).

source: The state in a finite state machine.
es_mx: El estado en una máquina de estados finita.
tr: Bir sonlu durum makinesindeki (state machine) durum.

source: Control for intermediate states of `ORM Model <http://en.wikipedia.org/wiki/Object-relational_mapping>`_ before saving.
es_mx: Control de estados intermedios de un `Modelo ORM <http://en.wikipedia.org/wiki/Object-relational_mapping>`_ antes de guardar.
tr: Kaydetmeden önce, bir `ORM Modeli <http://en.0wikipedia.org/wiki/Object-relational_mapping>`__' ara durumları için kontrol.

source: Alt Memento UML Diagram
es_mx: Alt Diagrama UML Memento
tr: Alt Memento UML Diyagramı

source: It provides the ability to restore an object to it's previous state (undo via rollback) or to gain access to state of the object, without revealing it's implementation (i.e., the object is not required to have a functional for return the current state).
fr: Il permet de rétablir l'état précédent d'un objet (annulation par retour en arrière) ou d'accéder à l'état de l'objet, sans révéler son implémentation (c'est-à-dire que l'objet n'est pas obligé d'avoir une fonction pour retourner l'état actuel).
nl: Het biedt de mogelijkheid om een ​​object te herstellen naar de vorige staat (ongedaan maken via terugzetting) of om toegang te krijgen tot de staat van het object, zonder de implementatie ervan te onthullen (d.w.z. het object hoeft geen functie te hebben om de huidige staat te retourneren).
ru: Шаблон предоставляет возможность восстановить объект в его предыдущем состоянии (отменить действие посредством отката к предыдущему состоянию) или получить доступ к состоянию объекта, не раскрывая его реализацию (т.е. сам объект не обязан иметь функциональность для возврата текущего состояния).

source: Memento
tr: Memento (Anımsatıcı)
