Repository: DesignPatternsPHP/DesignPatternsPHP
Catalog: locale/*/LC_MESSAGES/Structural/FluentInterface/README.po
Languages: es_mx, tr

source: Fluent Interface
es_mx: Interfaz Fluida
tr: Fluent Interface (Akıcı Arayüz)

source: Purpose
es_mx: Propósito
tr: Amaç

source: To write code that is easy readable just like sentences in a natural language (like English).
es_mx: Escribir código que sea fácilmente legible como si fueran enunciados en lenguaje natural (como inglés).
tr: Tıpkı doğal dillerdeki tümcelerde olduğu gibi (örn: Türkçe), kodu kolayca okunabilir bir biçimde yazmak.

source: Doctrine2's QueryBuilder works something like that example class below
es_mx: El Constructor de Consultas (QueryBuilder) de Doctrine2 funciona parecido a la clase ejemplo que está más abajo
tr: Doctrine2: ``QueryBuilder`` aşağıdaki örnek nesneye benzer bir biçimde çalışır.

source: PHPUnit uses fluent interfaces to build mock objects
es_mx: PHPUnit utiliza una interfaces fluidas para crear objetos de imitación (mock)
tr: PHPUnit: Akıcı arayüzleri yapaylamalar (mocking) için kullanır.

source: Yii Framework: CDbCommand and CActiveRecord use this pattern, too
es_mx: Yii Framework: CDbCommand y CActiveRecord utilizan este patrón también
tr: Yii Framework: ``CDbCommand`` ve ``CActiveRecord`` bu deseni kullanır.

source: UML Diagram
es_mx: Diagrama UML
tr: UML Diyagramı

source: Alt FluentInterface UML Diagram
es_mx: Alt Diagrama UML InterfazFluida
tr: Alt FluentInterface UML Diyagramı

source: Code
es_mx: Código
tr: Kod

source: You can also find these code on `GitHub`_
es_mx: Puedes encontrar este código también en `GitHub`_

source: Test
es_mx: Pruebas

source: You can also find this code on `GitHub`_
tr: Bu kodu `Github`_ üzerinde de bulabilirsiniz.
