Repository: DesignPatternsPHP/DesignPatternsPHP
Catalog: locale/*/LC_MESSAGES/Creational/SimpleFactory/README.po
Languages: ru, tr

source: Simple Factory
ru: Простая Фабрика (Simple Factory)
tr: Simple Factory (Basit Fabrika)

source: Purpose
ru: Назначение
tr: Amaç

source: SimpleFactory is a simple factory pattern.
ru: SimpleFactory в примере ниже, это паттерн «Простая Фабрика».
tr: Basit ve kontrollü bir şekilde nesneler oluşturmak.

source: It differs from the static factory because it is not static. Therefore, you can have multiple factories, differently parameterized, you can subclass it and you can mock it. It always should be preferred over a static factory!
ru: Она отличается от Статической Фабрики тем, что собственно *не является статической*. Таким образом, вы можете иметь множество фабрик с разными параметрами. Простая фабрика всегда должна быть предпочтительнее Статической фабрики!

source: Therefore, you can have multiple factories, differently parametrized, you can subclass it and you can mock it.
ru: Поэтому, вы можете иметь несколько фабрик, параметризованных различным образом. Вы можете унаследовать их и создавать макеты для тестирования.

source: It always should be preferred over a static factory!
ru: Простая фабрика всегда должна быть предпочтительнее статичной фабрики
tr: Her zaman statik bir fabrika yerine tercih edilmelidir!

source: UML Diagram
ru: Диаграмма UML
tr: UML Diyagramı

source: Code
ru: Код
tr: Kod

source: You can also find this code on `GitHub`_
ru: Вы можете найти этот код на `GitHub`_
tr: Bu kodu `Github`_ üzerinde de bulabilirsiniz.

source: Test
ru: Тест

source: It differs from the static factory because it is not static. Therefore, you can have multiple factories, differently parametrized, you can subclass it and you can mock it.
tr: Statik olmadığı için Statik Fabrika (Static Factory) deseninden farklıdır. Bu nedenle, birden fazla fabrika sahibi olunabilir ve bunlar değişik biçimlerde parametrize edilmiş, alt sınıflama (subclassing) veya yapaylama da (mocking) yapılmış olabilir.

source: Alt SimpleFactory UML Diagram
tr: Alt SimpleFactory UML Diyagramı

source: Usage
tr: Kullanım
