Repository: DesignPatternsPHP/DesignPatternsPHP
Catalog: locale/*/LC_MESSAGES/Structural/DependencyInjection/README.po
Languages: bg, nl, pl, pt_br, ru, tr, zh_cn

source: `Dependency Injection`__
bg: `Инжектиране на зависимости`__
pl: `Wstrzykiwanie zależności <https://pl.wikipedia.org/wiki/Wstrzykiwanie_zale%C5%BCno%C5%9Bci>`_ (`Dependency Injection`__)
pt_br: `Injeção de dependência (Dependency Injection)`__
ru: `Внедрение Зависимости <https://ru.wikipedia.org/wiki/Внедрение_зависимости>`_ (`Dependency Injection`__)
zh_cn: `依赖注入`

source: Purpose
bg: Предназначение
nl: Doel
pl: Przeznaczenie
pt_br: Objetivo
ru: Назначение
tr: Amaç
zh_cn: 目的

source: To implement a loosely coupled architecture in order to get better testable, maintainable and extendable code.
bg: Да приложите свободно свързана архитектура, за да получите по-добре тестваем, поддържаем и разширяем код.
nl: Om een ​​losjes gekoppelde architectuur te implementeren om beter testbare, onderhoudbare en uitbreidbare code te krijgen.
pl: Pozwala stworzyć luźno powiązaną architekturę, aby uzyskać aplikację, którą możemy w łatwy sposób testować, utrzymywać i rozszerzać.
pt_br: Para implementar uma arquitetura menos acoplada com o objetivo de obter um código mais fácil de testar, de melhor manutenibilidade e mais extensível.
ru: Для реализации слабосвязанной архитектуры. Чтобы получить более тестируемый, сопровождаемый и расширяемый код.
tr: Daha iyi test edilebilir, bakım yapılabilir ve genişletilebilir kod elde etmek için gevşek bağlı bir mimari uygulamak.
zh_cn: 实现了松耦合的软件架构，可得到更好的测试，管理和扩展的代码

source: Usage
bg: Исползване
nl: Gebruik
pl: Użycie
pt_br: Uso
ru: Использование
tr: Kullanım
zh_cn: 用例

source: Configuration gets injected and ``Connection`` will get all that it needs from ``$config``. Without DI, the configuration would be created directly in ``Connection``, which is not very good for testing and extending ``Connection``.
bg: Конфигурацията се инжектира и ``Connection`` ще получи всичко, от което се нуждае, от ``$ config``. Без DI конфигурацията ще бъде създадена директно в ``Connection``, което не е много добро за тестване и разширяване на ``Connection``.
nl: Configuratie wordt geïnjecteerd en `` Verbinding '' krijgt alles wat het nodig heeft van `` $ config ''. Zonder DI zou de configuratie rechtstreeks in `` Verbinding '' worden gemaakt, wat niet erg goed is voor het testen en uitbreiden van `` Verbinding ''.
ru: Объект Configuration внедряется в ``Connection`` и последний получает всё, что ему необходимо из переменной ``$ config``. Без DI, конфигурация будет создана непосредственно в ``Connection``, что не очень хорошо для тестирования и расширения ``Connection``, так как связывает эти классы напрямую.
zh_cn: 通过配置需要注入的依赖，``Connection`` 能从 ``$config`` 中获取到所有它需要的依赖。如果没有依赖注入，``Connection`` 会直接创建它需要的依赖，这样不利于测试和扩展``Connection``。

source: Notice we are following Inversion of control principle in ``Connection`` by asking ``$config`` to implement ``Parameters`` interface. This decouples our components. We don't care where the source of information comes from, we only care that ``$config`` has certain methods to retrieve that information. Read more about Inversion of control `here <http://en.wikipedia.org/wiki/Inversion_of_control>`__.
bg: Забележете, че следваме принципа на инверсия на управлението в ``Connection``, като поискаме ``$config`` да внедри интерфейса ``Parameters``. Това отделя нашите компоненти. Не ни интересува откъде идва източникът на информация, а само това, че ``$config`` има определени методи за извличане на тази информация. Прочетете повече за Инверсия на управление `тук <http://en.wikipedia.org/wiki/Inversion_of_control>` __.
nl: Merk op dat we het Inversion of control-principe in `` Connection '' volgen door `` $ config '' te vragen om de `` Parameters '' -interface te implementeren. Dit ontkoppelt onze componenten. Het maakt ons niet uit waar de informatiebron vandaan komt, het kan ons alleen schelen dat `` $ config '' bepaalde methoden heeft om die informatie op te halen. Lees meer over Inversion of control `hier <https://nl.wikipedia.org/wiki/Spring_Framework#Inversion_of_Control_(of_dependency_injection)>` __.
pl: Istotnym jest fakt, że klasa ``DatabaseConnection`` przestrzega zasady odwróconego sterowania (ang. `Inverse of Controll, IoC`) - obiekt, który przekazujemy do konstruktora klasy ``DatabaseConnection`` musi implementować ``DatabaseConfiguration``. Dzięki temu oba komponenty są od siebie niezależne. W klasie ``DatabaseConnection`` nie interesuje nas skąd przychodzą parametry konfiguracyjne. Liczy się dla nas tylko to, aby obiekt w argumencie ``$config`` posiadał odpowiednie metody, za pomocą których te dane pobierzemy. Więcej informacji na temat `odwóconego sterowania <https://pl.wikipedia.org/wiki/Odwr%C3%B3cenie_sterowania>`_.
pt_br: Note que estamos seguindo o princípio da inversão de controle em ``Connection`` por estar perguntando ``$config`` para implementar a interface ``Parameters``. Isto desacopla nossos componentes. Nós não nos importamos de onde vem a fonte de informação, nós apenas garantimos que ``$config`` tem certos métodos para recuperar a informação. Leia mais sobre Inversão de Controle `aqui <https://pt.wikipedia.org/wiki/Invers%C3%A3o_de_controle>`__.
ru: Обратите внимание, в ``Connection`` мы следуем принципу SOLID `Инверсия Управления <https://ru.wikipedia.org/wiki/Инверсия_управления>`_, запрашивая параметр ``$config``, чтобы реализовать интерфейс ``Parameters``. Это отделяет наши компоненты друг от друга. Нас не заботит, из какого источника поступает эта информация о конфигурации, мы заботимся только о том, что ``$config`` должен иметь определенные методы, чтобы мы могли получить эту информацию.
zh_cn: 注意我们一直在遵循控制反转的设计原则，``Connection`` 通过要求 ``$config`` 实现 ``Parameters`` 的接口。这样就达到了组建间的解耦。我们不需要关心信息的来源，只需要关心 ``$config`` 中一定有方法来获取我们需要的信息。阅读更多的关于控制反转的资料请点 `这里<http://en.wikipedia.org/wiki/Inversion_of_control>`__.

source: Examples
bg: Примери
nl: Bijvoorbeeld
pl: Przykłady
pt_br: Exemplos
ru: Примеры
tr: Örnekler
zh_cn: 例子

source: The Doctrine2 ORM uses dependency injection e.g. for configuration that is injected into a ``Connection`` object. For testing purposes, one can easily create a mock object of the configuration and inject that into the ``Connection`` object
bg: Doctrine2 ORM използва инжекция на зависимост, напр. за конфигурация, която се инжектира в обект ``Connection``. За целите на тестването, можете лесно да създадете фалшив обект от конфигурацията и да го инжектирате в обекта ``Connection``
nl: De Doctrine2 ORM gebruikt afhankelijkheidsinjectie, bijv. voor configuratie die wordt geïnjecteerd in een `` Connection '' -object. Voor testdoeleinden kan men eenvoudig een nep-object van de configuratie maken en dat in het `` Connection '' -object injecteren
pl: Doctrine2 ORM używa wstrzykiwania zależności do, na przykład, do wstrzykiwania konfiguracji do obiektu klasy ``Connection``. Na potrzeby testowania, można stworzyć obiekty symulujące konfigurację i wstrzyknąć je do obiektu klasy ``Connection``.
pt_br: O ORM Doctrine 2 usa injeção de dependência, por exemplo, para a configuração que é injetada no objeto ``Connection``. Para propósitos de teste, algúem pode facilmente criar um objeto simulado na configuração e injetá-lo no objeto ``Connection``.
ru: The Doctrine2 ORM использует Внедрение Зависимости например для конфигурации, которая внедряется в объект ``Connection``. Для целей тестирования, можно легко создать макет объекта конфигурации и внедрить его в объект ``Connection``, подменив оригинальный.
tr: Doctrine2 ORM bağımlılık aktarımını kullanır. Örneğin bir ``Connection`` nesnesi, yapılandırma (configuration) nesnesine bağımlanmıştır. Test amacıyla bir yapılandırma yapaylaması (configuration mock) kolayca oluşturulabilir ve ``Connection`` nesnesine aktarılabilir.
zh_cn: Doctrine2 ORM 使用了依赖注入，它通过配置注入了 ``Connection`` 对象。为了达到方便测试的目的，可以很容易的通过配置创建一个mock的``Connection`` 对象。

source: many frameworks already have containers for DI that create objects via a configuration array and inject them where needed (i.e. in Controllers)
bg: много фреймуърки вече имат контейнери за DI, които създават обекти чрез конфигурационен масив и ги инжектират там, където е необходимо (т.е. в контролери)
nl: veel frameworks hebben al containers voor DI die objecten maken via een configuratie-array en deze waar nodig injecteren (d.w.z. in controllers)

source: UML Diagram
bg: UML Диаграма
pl: Diagram UML
pt_br: Diagrama UML
ru: UML Диаграмма
tr: UML Diyagramı
zh_cn: UML 图

source: Code
bg: Код
pl: Kod
pt_br: Código
ru: Код
tr: Kod
zh_cn: 代码

source: You can also find this code on `GitHub`_
bg: Можете също да намерите този код в `GitHub`_
nl: Je kan deze broncode terugvinden op `GitHub`_
pl: Ten kod znajdziesz również na `GitHub`_.
pt_br: Você pode também ver este código no `GitHub`_
tr: Bu kodu `Github`_ üzerinde de bulabilirsiniz.

source: Test
bg: Тест
nl: Теst
pl: Testy
pt_br: Teste
ru: Тест
zh_cn: 测试

source: DatabaseConfiguration gets injected and ``DatabaseConnection`` will get all that it needs from ``$config``. Without DI, the configuration would be created directly in ``DatabaseConnection``, which is not very good for testing and extending it.
pl: Konfiguracja połączenia z bazą danych zostaje wstrzyknięta i obiekt klasy ``DatabaseConnection`` może pobrać wszystkie potrzebne parametry z tablicy ``$config``. Bez Wstrzykiwania zależności zostałaby zawarta bezpośrednio w klasie ``DatabaseConnection``, co nie jest dobrym pomysłem ze względu na utrudnione testowanie i rozszerzanie klasy ``DatabaseConnection``.
tr: ``DatabaseConnection`` nesnesi ``DatabaseConfiguration`` nesnesine bağımlanır ve gereksinimlerini ``$config`` değişkeninden alır. Bağımlılık aktarımı olmaksızın yapılandırma (configuration), ``DatabaseConnection`` nesnesi içinde oluşturulabilir. Ancak bu, iyi bir test ve genişletme olanaklarını ortadan kaldıracaktır.

source: Symfony and Zend Framework 2 already have containers for DI that create objects via a configuration array and inject them where needed (i.e. in Controllers)
pl: Symfony i Zend Framework 2 posiadają kontenery do wstrzykiwania zależności, które pozwalają tworzyć obiekty poprzez tablicę konfiguracyjną i wstrzykiwać je tam, gdzie są potrzebne (na przykład do kontrolera).
pt_br: Symfony e Zend Framework 2 já tem recipientes para injeção de dependência que criam objetos através de um array de configuração e injetam eles onde for necessário (p.e. nos Controllers)
ru: Symfony и Zend Framework 2 уже содержат контейнеры для DI, которые создают объекты с помощью массива из конфигурации, и внедряют их в случае необходимости (т.е. в Контроллерах).
tr: Symfony ve Zend Framework 2, bir yapılandırma dizisi (configuration array) aracılığıyla nesneler oluşturan ve bunları gerekli yerlere aktaran (örn: Denetçiler'e (Controllers)) bağımlılık aktarımı kapsayıcılarına (containers) sahiptirler.
zh_cn: Symfony 和 Zend Framework 2 也有了专门的依赖注入容器，用来通过配置数据创建需要的对象(比如在控制器中使用依赖注入容器获取所需的对象)

source: ``DatabaseConfiguration`` gets injected and ``DatabaseConnection`` will get all that it needs from ``$config``. Without DI, the configuration would be created directly in ``DatabaseConnection``, which is not very good for testing and extending it.
pt_br: ``DatabaseConfiguration`` é injetado e ``DatabaseConnection`` irá receber tudo o que é necessário de ``$config``. Sem a Injeção de Dependência, a configuração seria criada diretamente em ``DatabaseConnection``, o que não é muito bom para testar e extender isto.

source: You can also find these code on `GitHub`_
ru: Вы можете найти этот код на `GitHub`_
zh_cn: 你可以在 `GitHub`_ 上找到这些代码

source: Dependency Injection
tr: Dependency Injection (Bağımlılık Aktarımı)

source: Alt DependencyInjection UML Diagram
tr: Alt DependencyInjection UML Diyagramı
