Repository: DesignPatternsPHP/DesignPatternsPHP
Catalog: locale/*/LC_MESSAGES/Behavioral/Strategy/README.po
Languages: pl, tr

source: `Strategy`__
pl: `Strategia <https://pl.wikipedia.org/wiki/Strategia_(wzorzec_projektowy)>`_ (`Strategy`__)

source: Terminology:
pl: Terminologia

source: Context
pl: Kontekst - ang. `Context`
tr: Context (Bağlam)

source: Strategy
pl: Strategia - ang. `Strategy`
tr: Strategy (Yordam)

source: Concrete Strategy
pl: Konkretna Strategia - ang. `Concrete Strategy`
tr: Concrete Strategy (Somut Yordam)

source: Purpose
pl: Przeznaczenie
tr: Amaç

source: To separate strategies and to enable fast switching between them. Also this pattern is a good alternative to inheritance (instead of having an abstract class that is extended).
pl: Wzorzec projektowy Strategii pozwala definiować wymienne algorytmy i kapsułkować je w klasach. Dzięki temu możemy łatwo przełączać się między algorytmami. Ten wzorzec jest również dobrą alternatywą dla dziedziczenia - zamiast dziedziczenia po klasie abstrakcyjnej kolejne klasy implementują interfejs strategii.
tr: Yordamları ayırarak, aralarındaki hızlı geçişlere olanak sağlamak. Aynı zamanda bu desen, kalıtım (inheritance) için iyi bir alternatiftir (genişletilmiş soyut bir sınıf sahibi olmak yerine).

source: Examples
pl: Przykłady
tr: Örnekler

source: sorting a list of objects, one strategy by date, the other by id
pl: Sortowanie listy obiektów - jedną strategią może być sortowanie po dacie, drugą po id.

source: simplify unit testing: e.g. switching between file and in-memory storage
pl: Uproszczenie testów jednostkowych, na przykład poprzez zmianę miejsca przechowywania danych: w pliku lub w pamięci.

source: UML Diagram
pl: Diagram UML
tr: UML Diyagramı

source: Code
pl: Kod
tr: Kod

source: You can also find this code on `GitHub`_
pl: Ten kod znajdziesz również na `GitHub`_.
tr: Bu kodu `Github`_ üzerinde de bulabilirsiniz.

source: Test
pl: Testy

source: Terminology
tr: Terimler

source: Sorting a list of objects, one strategy by date, the other by id.
tr: Bir nesneler dizisinin sıralanması: birinin 'date', bir diğerinin 'id' değerlerine göre.

source: Simplify unit testing: e.g. switching between file and in-memory storage.
tr: Birim testinin kolaylaştırılması: örneğin dosya ve bellek odaklı saklama işlemleri arasındaki geçişler.

source: Alt Strategy UML Diagram
tr: Alt Strategy UML Diyagramı
